SiliconLabsSoftware/boltON/NXP/ncp_host_MCXA156/source/sli_bt_api.h
/***************************************************************************//**
 * @brief SL_BT_API library at application layer provided as source code
 *******************************************************************************
 * # License
 * <b>Copyright 2020 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * The licensor of this software is Silicon Laboratories Inc. Your use of this
 * software is governed by the terms of Silicon Labs Master Software License
 * Agreement (MSLA) available at
 * www.silabs.com/about-us/legal/master-software-license-agreement. This
 * software is distributed to you in Source Code format and is governed by the
 * sections of the MSLA applicable to Source Code.
 *
 ******************************************************************************/

#ifndef SLI_BT_API_H
#define SLI_BT_API_H
#define VERSION no_link_tables

#include "sl_bt_api.h"

#ifdef __cplusplus
extern "C" {
#endif

enum sli_bt_class_id
{
    sli_bt_dfu_class_id = 0x00,
    sli_bt_system_class_id = 0x01,
    sli_bt_resource_class_id = 0x5f,
    sli_bt_gap_class_id = 0x02,
    sli_bt_advertiser_class_id = 0x04,
    sli_bt_legacy_advertiser_class_id = 0x56,
    sli_bt_extended_advertiser_class_id = 0x57,
    sli_bt_periodic_advertiser_class_id = 0x58,
    sli_bt_scanner_class_id = 0x05,
    sli_bt_sync_class_id = 0x42,
    sli_bt_sync_scanner_class_id = 0x50,
    sli_bt_past_receiver_class_id = 0x51,
    sli_bt_advertiser_past_class_id = 0x52,
    sli_bt_sync_past_class_id = 0x5b,
    sli_bt_periodic_sync_class_id = 0x53,
    sli_bt_pawr_sync_class_id = 0x54,
    sli_bt_pawr_advertiser_class_id = 0x55,
    sli_bt_connection_class_id = 0x06,
    sli_bt_gatt_class_id = 0x09,
    sli_bt_gattdb_class_id = 0x46,
    sli_bt_gatt_server_class_id = 0x0a,
    sli_bt_nvm_class_id = 0x0d,
    sli_bt_test_class_id = 0x0e,
    sli_bt_sm_class_id = 0x0f,
    sli_bt_external_bondingdb_class_id = 0x5c,
    sli_bt_resolving_list_class_id = 0x5d,
    sli_bt_accept_list_class_id = 0x5e,
    sli_bt_coex_class_id = 0x20,
    sli_bt_cs_class_id = 0x59,
    sli_bt_cs_test_class_id = 0x5A,
    sli_bt_l2cap_class_id = 0x43,
    sli_bt_cte_transmitter_class_id = 0x44,
    sli_bt_cte_receiver_class_id = 0x45,
    sli_bt_connection_analyzer_class_id = 0x48,
    sli_bt_user_class_id = 0xff,
};

enum sli_bt_command_id
{
    sli_bt_dfu_flash_set_address_command_id = 0x01,
    sli_bt_dfu_flash_upload_command_id = 0x02,
    sli_bt_dfu_flash_upload_finish_command_id = 0x03,
    sli_bt_system_hello_command_id = 0x00,
    sli_bt_system_start_bluetooth_command_id = 0x1c,
    sli_bt_system_stop_bluetooth_command_id = 0x1d,
    sli_bt_system_forcefully_stop_bluetooth_command_id = 0x1e,
    sli_bt_system_get_version_command_id = 0x1b,
    sli_bt_system_reboot_command_id = 0x1f,
    sli_bt_system_halt_command_id = 0x0c,
    sli_bt_system_linklayer_configure_command_id = 0x0e,
    sli_bt_system_set_tx_power_command_id = 0x17,
    sli_bt_system_get_tx_power_setting_command_id = 0x18,
    sli_bt_system_set_identity_address_command_id = 0x13,
    sli_bt_system_get_identity_address_command_id = 0x15,
    sli_bt_system_get_random_data_command_id = 0x0b,
    sli_bt_system_data_buffer_write_command_id = 0x12,
    sli_bt_system_data_buffer_clear_command_id = 0x14,
    sli_bt_system_get_counters_command_id = 0x0f,
    sli_bt_system_set_lazy_soft_timer_command_id = 0x1a,
    sli_bt_system_reset_command_id = 0x01,
    sli_bt_resource_get_status_command_id = 0x00,
    sli_bt_resource_set_report_threshold_command_id = 0x01,
    sli_bt_resource_enable_connection_tx_report_command_id = 0x02,
    sli_bt_resource_get_connection_tx_status_command_id = 0x03,
    sli_bt_resource_disable_connection_tx_report_command_id = 0x04,
    sli_bt_gap_set_privacy_mode_command_id = 0x01,
    sli_bt_gap_set_data_channel_classification_command_id = 0x02,
    sli_bt_gap_set_identity_address_command_id = 0x04,
    sli_bt_gap_get_identity_address_command_id = 0x05,
    sli_bt_advertiser_create_set_command_id = 0x01,
    sli_bt_advertiser_configure_command_id = 0x12,
    sli_bt_advertiser_set_timing_command_id = 0x03,
    sli_bt_advertiser_set_channel_map_command_id = 0x04,
    sli_bt_advertiser_set_tx_power_command_id = 0x0b,
    sli_bt_advertiser_set_report_scan_request_command_id = 0x05,
    sli_bt_advertiser_set_random_address_command_id = 0x10,
    sli_bt_advertiser_clear_random_address_command_id = 0x11,
    sli_bt_advertiser_stop_command_id = 0x0a,
    sli_bt_advertiser_delete_set_command_id = 0x02,
    sli_bt_legacy_advertiser_set_data_command_id = 0x00,
    sli_bt_legacy_advertiser_generate_data_command_id = 0x01,
    sli_bt_legacy_advertiser_start_command_id = 0x02,
    sli_bt_legacy_advertiser_start_directed_command_id = 0x03,
    sli_bt_extended_advertiser_set_phy_command_id = 0x00,
    sli_bt_extended_advertiser_set_data_command_id = 0x01,
    sli_bt_extended_advertiser_set_long_data_command_id = 0x02,
    sli_bt_extended_advertiser_generate_data_command_id = 0x03,
    sli_bt_extended_advertiser_start_command_id = 0x04,
    sli_bt_extended_advertiser_start_directed_command_id = 0x05,
    sli_bt_periodic_advertiser_set_data_command_id = 0x00,
    sli_bt_periodic_advertiser_set_long_data_command_id = 0x01,
    sli_bt_periodic_advertiser_start_command_id = 0x02,
    sli_bt_periodic_advertiser_stop_command_id = 0x03,
    sli_bt_scanner_set_parameters_command_id = 0x06,
    sli_bt_scanner_set_parameters_and_filter_command_id = 0x07,
    sli_bt_scanner_start_command_id = 0x03,
    sli_bt_scanner_stop_command_id = 0x05,
    sli_bt_sync_set_reporting_mode_command_id = 0x03,
    sli_bt_sync_update_sync_parameters_command_id = 0x04,
    sli_bt_sync_close_command_id = 0x01,
    sli_bt_sync_scanner_set_sync_parameters_command_id = 0x00,
    sli_bt_sync_scanner_open_command_id = 0x01,
    sli_bt_past_receiver_set_default_sync_receive_parameters_command_id = 0x00,
    sli_bt_past_receiver_set_sync_receive_parameters_command_id = 0x01,
    sli_bt_advertiser_past_transfer_command_id = 0x00,
    sli_bt_sync_past_transfer_command_id = 0x00,
    sli_bt_pawr_sync_set_sync_subevents_command_id = 0x02,
    sli_bt_pawr_sync_set_response_data_command_id = 0x03,
    sli_bt_pawr_advertiser_start_command_id = 0x00,
    sli_bt_pawr_advertiser_set_subevent_data_command_id = 0x01,
    sli_bt_pawr_advertiser_create_connection_command_id = 0x02,
    sli_bt_pawr_advertiser_stop_command_id = 0x03,
    sli_bt_connection_set_default_parameters_command_id = 0x00,
    sli_bt_connection_set_default_preferred_phy_command_id = 0x01,
    sli_bt_connection_set_default_data_length_command_id = 0x10,
    sli_bt_connection_set_default_acceptable_subrate_command_id = 0x19,
    sli_bt_connection_open_command_id = 0x04,
    sli_bt_connection_open_with_accept_list_command_id = 0x16,
    sli_bt_connection_set_parameters_command_id = 0x06,
    sli_bt_connection_set_preferred_phy_command_id = 0x08,
    sli_bt_connection_disable_slave_latency_command_id = 0x03,
    sli_bt_connection_get_median_rssi_command_id = 0x15,
    sli_bt_connection_read_channel_map_command_id = 0x07,
    sli_bt_connection_set_power_reporting_command_id = 0x09,
    sli_bt_connection_set_remote_power_reporting_command_id = 0x0a,
    sli_bt_connection_get_tx_power_command_id = 0x0b,
    sli_bt_connection_get_remote_tx_power_command_id = 0x0c,
    sli_bt_connection_set_tx_power_command_id = 0x12,
    sli_bt_connection_read_remote_used_features_command_id = 0x0d,
    sli_bt_connection_get_security_status_command_id = 0x0e,
    sli_bt_connection_set_data_length_command_id = 0x11,
    sli_bt_connection_read_statistics_command_id = 0x13,
    sli_bt_connection_get_scheduling_details_command_id = 0x14,
    sli_bt_connection_get_remote_address_command_id = 0x17,
    sli_bt_connection_request_subrate_command_id = 0x1A,
    sli_bt_connection_get_state_command_id = 0x18,
    sli_bt_connection_close_command_id = 0x05,
    sli_bt_connection_forcefully_close_command_id = 0x0f,
    sli_bt_gatt_set_max_mtu_command_id = 0x00,
    sli_bt_gatt_discover_primary_services_command_id = 0x01,
    sli_bt_gatt_discover_primary_services_by_uuid_command_id = 0x02,
    sli_bt_gatt_find_included_services_command_id = 0x10,
    sli_bt_gatt_discover_characteristics_command_id = 0x03,
    sli_bt_gatt_discover_characteristics_by_uuid_command_id = 0x04,
    sli_bt_gatt_discover_descriptors_command_id = 0x06,
    sli_bt_gatt_discover_characteristic_descriptors_command_id = 0x14,
    sli_bt_gatt_set_characteristic_notification_command_id = 0x05,
    sli_bt_gatt_send_characteristic_confirmation_command_id = 0x0d,
    sli_bt_gatt_read_characteristic_value_command_id = 0x07,
    sli_bt_gatt_read_characteristic_value_from_offset_command_id = 0x12,
    sli_bt_gatt_read_multiple_characteristic_values_command_id = 0x11,
    sli_bt_gatt_read_variable_length_characteristic_values_command_id = 0x16,
    sli_bt_gatt_read_characteristic_value_by_uuid_command_id = 0x08,
    sli_bt_gatt_write_characteristic_value_command_id = 0x09,
    sli_bt_gatt_write_characteristic_value_without_response_command_id = 0x0a,
    sli_bt_gatt_prepare_characteristic_value_write_command_id = 0x0b,
    sli_bt_gatt_prepare_characteristic_value_reliable_write_command_id = 0x13,
    sli_bt_gatt_execute_characteristic_value_write_command_id = 0x0c,
    sli_bt_gatt_read_descriptor_value_command_id = 0x0e,
    sli_bt_gatt_write_descriptor_value_command_id = 0x0f,
    sli_bt_gatt_get_mtu_command_id = 0x15,
    sli_bt_gattdb_new_session_command_id = 0x00,
    sli_bt_gattdb_add_service_command_id = 0x01,
    sli_bt_gattdb_remove_service_command_id = 0x02,
    sli_bt_gattdb_add_included_service_command_id = 0x03,
    sli_bt_gattdb_remove_included_service_command_id = 0x04,
    sli_bt_gattdb_add_uuid16_characteristic_command_id = 0x05,
    sli_bt_gattdb_add_uuid128_characteristic_command_id = 0x06,
    sli_bt_gattdb_remove_characteristic_command_id = 0x07,
    sli_bt_gattdb_add_uuid16_descriptor_command_id = 0x08,
    sli_bt_gattdb_add_uuid128_descriptor_command_id = 0x09,
    sli_bt_gattdb_remove_descriptor_command_id = 0x0a,
    sli_bt_gattdb_start_service_command_id = 0x0b,
    sli_bt_gattdb_stop_service_command_id = 0x0c,
    sli_bt_gattdb_start_characteristic_command_id = 0x0d,
    sli_bt_gattdb_stop_characteristic_command_id = 0x0e,
    sli_bt_gattdb_commit_command_id = 0x0f,
    sli_bt_gattdb_abort_command_id = 0x10,
    sli_bt_gattdb_get_attribute_state_command_id = 0x11,
    sli_bt_gatt_server_set_max_mtu_command_id = 0x0a,
    sli_bt_gatt_server_get_mtu_command_id = 0x0b,
    sli_bt_gatt_server_find_attribute_command_id = 0x06,
    sli_bt_gatt_server_find_primary_service_command_id = 0x09,
    sli_bt_gatt_server_read_attribute_value_command_id = 0x00,
    sli_bt_gatt_server_read_attribute_type_command_id = 0x01,
    sli_bt_gatt_server_read_attribute_properties_command_id = 0x05,
    sli_bt_gatt_server_write_attribute_value_command_id = 0x02,
    sli_bt_gatt_server_send_user_read_response_command_id = 0x03,
    sli_bt_gatt_server_send_user_write_response_command_id = 0x04,
    sli_bt_gatt_server_send_notification_command_id = 0x0f,
    sli_bt_gatt_server_send_indication_command_id = 0x10,
    sli_bt_gatt_server_notify_all_command_id = 0x11,
    sli_bt_gatt_server_read_client_configuration_command_id = 0x12,
    sli_bt_gatt_server_send_user_prepare_write_response_command_id = 0x14,
    sli_bt_gatt_server_set_capabilities_command_id = 0x08,
    sli_bt_gatt_server_enable_capabilities_command_id = 0x0c,
    sli_bt_gatt_server_disable_capabilities_command_id = 0x0d,
    sli_bt_gatt_server_get_enabled_capabilities_command_id = 0x0e,
    sli_bt_gatt_server_read_client_supported_features_command_id = 0x15,
    sli_bt_nvm_save_command_id = 0x02,
    sli_bt_nvm_load_command_id = 0x03,
    sli_bt_nvm_erase_command_id = 0x04,
    sli_bt_nvm_erase_all_command_id = 0x01,
    sli_bt_test_dtm_tx_v4_command_id = 0x03,
    sli_bt_test_dtm_tx_cw_command_id = 0x04,
    sli_bt_test_dtm_rx_command_id = 0x01,
    sli_bt_test_dtm_end_command_id = 0x02,
    sli_bt_sm_configure_command_id = 0x01,
    sli_bt_sm_set_minimum_key_size_command_id = 0x14,
    sli_bt_sm_set_debug_mode_command_id = 0x0f,
    sli_bt_sm_store_bonding_configuration_command_id = 0x02,
    sli_bt_sm_set_bondable_mode_command_id = 0x00,
    sli_bt_sm_set_passkey_command_id = 0x10,
    sli_bt_sm_increase_security_command_id = 0x04,
    sli_bt_sm_enter_passkey_command_id = 0x08,
    sli_bt_sm_passkey_confirm_command_id = 0x09,
    sli_bt_sm_bonding_confirm_command_id = 0x0e,
    sli_bt_sm_delete_bonding_command_id = 0x06,
    sli_bt_sm_delete_bondings_command_id = 0x07,
    sli_bt_sm_get_bonding_handles_command_id = 0x15,
    sli_bt_sm_get_bonding_details_command_id = 0x16,
    sli_bt_sm_find_bonding_by_address_command_id = 0x17,
    sli_bt_sm_resolve_rpa_command_id = 0x1d,
    sli_bt_sm_set_bonding_key_command_id = 0x18,
    sli_bt_sm_set_legacy_oob_command_id = 0x19,
    sli_bt_sm_set_oob_command_id = 0x1a,
    sli_bt_sm_set_remote_oob_command_id = 0x1b,
    sli_bt_external_bondingdb_set_data_command_id = 0x00,
    sli_bt_resolving_list_add_device_by_bonding_command_id = 0x00,
    sli_bt_resolving_list_add_device_by_address_command_id = 0x01,
    sli_bt_resolving_list_remove_device_by_bonding_command_id = 0x02,
    sli_bt_resolving_list_remove_device_by_address_command_id = 0x03,
    sli_bt_resolving_list_remove_all_devices_command_id = 0x04,
    sli_bt_accept_list_add_device_by_bonding_command_id = 0x00,
    sli_bt_accept_list_add_device_by_address_command_id = 0x01,
    sli_bt_accept_list_remove_device_by_bonding_command_id = 0x02,
    sli_bt_accept_list_remove_device_by_address_command_id = 0x03,
    sli_bt_accept_list_remove_all_devices_command_id = 0x04,
    sli_bt_coex_set_options_command_id = 0x00,
    sli_bt_coex_set_parameters_command_id = 0x02,
    sli_bt_coex_set_directional_priority_pulse_command_id = 0x03,
    sli_bt_coex_get_parameters_command_id = 0x04,
    sli_bt_coex_get_counters_command_id = 0x01,
    sli_bt_cs_security_enable_command_id = 0x00,
    sli_bt_cs_set_default_settings_command_id = 0x01,
    sli_bt_cs_create_config_command_id = 0x02,
    sli_bt_cs_remove_config_command_id = 0x03,
    sli_bt_cs_set_channel_classification_command_id = 0x04,
    sli_bt_cs_set_procedure_parameters_command_id = 0x05,
    sli_bt_cs_procedure_enable_command_id = 0x06,
    sli_bt_cs_set_antenna_configuration_command_id = 0x07,
    sli_bt_cs_read_local_supported_capabilities_command_id = 0x08,
    sli_bt_cs_read_remote_supported_capabilities_command_id = 0x09,
    sli_bt_cs_test_start_command_id = 0x00,
    sli_bt_cs_test_end_command_id = 0x01,
    sli_bt_l2cap_open_le_channel_command_id = 0x01,
    sli_bt_l2cap_send_le_channel_open_response_command_id = 0x02,
    sli_bt_l2cap_channel_send_data_command_id = 0x03,
    sli_bt_l2cap_channel_send_credit_command_id = 0x04,
    sli_bt_l2cap_close_channel_command_id = 0x05,
    sli_bt_cte_transmitter_set_dtm_parameters_command_id = 0x04,
    sli_bt_cte_transmitter_clear_dtm_parameters_command_id = 0x05,
    sli_bt_cte_transmitter_enable_connection_cte_command_id = 0x00,
    sli_bt_cte_transmitter_disable_connection_cte_command_id = 0x01,
    sli_bt_cte_transmitter_enable_connectionless_cte_command_id = 0x02,
    sli_bt_cte_transmitter_disable_connectionless_cte_command_id = 0x03,
    sli_bt_cte_transmitter_enable_silabs_cte_command_id = 0x06,
    sli_bt_cte_transmitter_disable_silabs_cte_command_id = 0x07,
    sli_bt_cte_receiver_set_dtm_parameters_command_id = 0x05,
    sli_bt_cte_receiver_clear_dtm_parameters_command_id = 0x06,
    sli_bt_cte_receiver_set_sync_cte_type_command_id = 0x09,
    sli_bt_cte_receiver_set_default_sync_receive_parameters_command_id = 0x0a,
    sli_bt_cte_receiver_set_sync_receive_parameters_command_id = 0x0b,
    sli_bt_cte_receiver_configure_command_id = 0x00,
    sli_bt_cte_receiver_enable_connection_cte_command_id = 0x01,
    sli_bt_cte_receiver_disable_connection_cte_command_id = 0x02,
    sli_bt_cte_receiver_enable_connectionless_cte_command_id = 0x03,
    sli_bt_cte_receiver_disable_connectionless_cte_command_id = 0x04,
    sli_bt_cte_receiver_enable_silabs_cte_command_id = 0x07,
    sli_bt_cte_receiver_disable_silabs_cte_command_id = 0x08,
    sli_bt_connection_analyzer_start_command_id = 0x00,
    sli_bt_connection_analyzer_stop_command_id = 0x01,
    sli_bt_user_message_to_target_command_id = 0x00,
    sli_bt_user_manage_event_filter_command_id = 0x01,
    sli_bt_user_reset_to_dfu_command_id = 0x02,
    sli_bt_user_cs_service_message_to_target_command_id = 0x03,
};

