SiliconLabsSoftware/boltON/NXP/ncp_host_MCXA156/source/sli_bt_api.h
PACKSTRUCT( struct sl_bt_cmd_dfu_flash_upload_s
{
    uint8array data;
});

typedef struct sl_bt_cmd_dfu_flash_upload_s sl_bt_cmd_dfu_flash_upload_t;


PACKSTRUCT( struct sl_bt_cmd_system_halt_s
{
    uint8_t halt;
});

typedef struct sl_bt_cmd_system_halt_s sl_bt_cmd_system_halt_t;


PACKSTRUCT( struct sl_bt_cmd_system_linklayer_configure_s
{
    uint8_t key;
    uint8array data;
});

typedef struct sl_bt_cmd_system_linklayer_configure_s sl_bt_cmd_system_linklayer_configure_t;


PACKSTRUCT( struct sl_bt_cmd_system_set_tx_power_s
{
    int16_t min_power;
    int16_t max_power;
});

typedef struct sl_bt_cmd_system_set_tx_power_s sl_bt_cmd_system_set_tx_power_t;


PACKSTRUCT( struct sl_bt_cmd_system_set_identity_address_s
{
    bd_addr address;
    uint8_t type;
});

typedef struct sl_bt_cmd_system_set_identity_address_s sl_bt_cmd_system_set_identity_address_t;


PACKSTRUCT( struct sl_bt_cmd_system_get_random_data_s
{
    uint8_t length;
});

typedef struct sl_bt_cmd_system_get_random_data_s sl_bt_cmd_system_get_random_data_t;


PACKSTRUCT( struct sl_bt_cmd_system_data_buffer_write_s
{
    uint8array data;
});

typedef struct sl_bt_cmd_system_data_buffer_write_s sl_bt_cmd_system_data_buffer_write_t;


PACKSTRUCT( struct sl_bt_cmd_system_get_counters_s
{
    uint8_t reset;
});

typedef struct sl_bt_cmd_system_get_counters_s sl_bt_cmd_system_get_counters_t;


PACKSTRUCT( struct sl_bt_cmd_system_set_lazy_soft_timer_s
{
    uint32_t time;
    uint32_t slack;
    uint8_t handle;
    uint8_t single_shot;
});

typedef struct sl_bt_cmd_system_set_lazy_soft_timer_s sl_bt_cmd_system_set_lazy_soft_timer_t;


PACKSTRUCT( struct sl_bt_cmd_system_reset_s
{
    uint8_t dfu;
});

typedef struct sl_bt_cmd_system_reset_s sl_bt_cmd_system_reset_t;


PACKSTRUCT( struct sl_bt_cmd_resource_set_report_threshold_s
{
    uint32_t low;
    uint32_t high;
});

typedef struct sl_bt_cmd_resource_set_report_threshold_s sl_bt_cmd_resource_set_report_threshold_t;


PACKSTRUCT( struct sl_bt_cmd_resource_enable_connection_tx_report_s
{
    uint16_t packet_count;
});

typedef struct sl_bt_cmd_resource_enable_connection_tx_report_s sl_bt_cmd_resource_enable_connection_tx_report_t;


PACKSTRUCT( struct sl_bt_cmd_resource_get_connection_tx_status_s
{
    uint8_t connection;
});

typedef struct sl_bt_cmd_resource_get_connection_tx_status_s sl_bt_cmd_resource_get_connection_tx_status_t;


PACKSTRUCT( struct sl_bt_cmd_gap_set_privacy_mode_s
{
    uint8_t privacy;
    uint8_t interval;
});

typedef struct sl_bt_cmd_gap_set_privacy_mode_s sl_bt_cmd_gap_set_privacy_mode_t;


PACKSTRUCT( struct sl_bt_cmd_gap_set_data_channel_classification_s
{
    uint8array channel_map;
});

typedef struct sl_bt_cmd_gap_set_data_channel_classification_s sl_bt_cmd_gap_set_data_channel_classification_t;


PACKSTRUCT( struct sl_bt_cmd_gap_set_identity_address_s
{
    bd_addr address;
    uint8_t addr_type;
});

typedef struct sl_bt_cmd_gap_set_identity_address_s sl_bt_cmd_gap_set_identity_address_t;


PACKSTRUCT( struct sl_bt_cmd_advertiser_configure_s
{
    uint8_t advertising_set;
    uint32_t flags;
});

typedef struct sl_bt_cmd_advertiser_configure_s sl_bt_cmd_advertiser_configure_t;


PACKSTRUCT( struct sl_bt_cmd_advertiser_set_timing_s
{
    uint8_t advertising_set;
    uint32_t interval_min;
    uint32_t interval_max;
    uint16_t duration;
    uint8_t maxevents;
});

typedef struct sl_bt_cmd_advertiser_set_timing_s sl_bt_cmd_advertiser_set_timing_t;


PACKSTRUCT( struct sl_bt_cmd_advertiser_set_channel_map_s
{
    uint8_t advertising_set;
    uint8_t channel_map;
});

typedef struct sl_bt_cmd_advertiser_set_channel_map_s sl_bt_cmd_advertiser_set_channel_map_t;


PACKSTRUCT( struct sl_bt_cmd_advertiser_set_tx_power_s
{
    uint8_t advertising_set;
    int16_t power;
});

typedef struct sl_bt_cmd_advertiser_set_tx_power_s sl_bt_cmd_advertiser_set_tx_power_t;


PACKSTRUCT( struct sl_bt_cmd_advertiser_set_report_scan_request_s
{
    uint8_t advertising_set;
    uint8_t report_scan_req;
});

typedef struct sl_bt_cmd_advertiser_set_report_scan_request_s sl_bt_cmd_advertiser_set_report_scan_request_t;


PACKSTRUCT( struct sl_bt_cmd_advertiser_set_random_address_s
{
    uint8_t advertising_set;
    uint8_t addr_type;
    bd_addr address;
});

typedef struct sl_bt_cmd_advertiser_set_random_address_s sl_bt_cmd_advertiser_set_random_address_t;


PACKSTRUCT( struct sl_bt_cmd_advertiser_clear_random_address_s
{
    uint8_t advertising_set;
});

typedef struct sl_bt_cmd_advertiser_clear_random_address_s sl_bt_cmd_advertiser_clear_random_address_t;


PACKSTRUCT( struct sl_bt_cmd_advertiser_stop_s
{
    uint8_t advertising_set;
});

typedef struct sl_bt_cmd_advertiser_stop_s sl_bt_cmd_advertiser_stop_t;


PACKSTRUCT( struct sl_bt_cmd_advertiser_delete_set_s
{
    uint8_t advertising_set;
});

typedef struct sl_bt_cmd_advertiser_delete_set_s sl_bt_cmd_advertiser_delete_set_t;


PACKSTRUCT( struct sl_bt_cmd_legacy_advertiser_set_data_s
{
    uint8_t advertising_set;
    uint8_t type;
    uint8array data;
});

typedef struct sl_bt_cmd_legacy_advertiser_set_data_s sl_bt_cmd_legacy_advertiser_set_data_t;


PACKSTRUCT( struct sl_bt_cmd_legacy_advertiser_generate_data_s
{
    uint8_t advertising_set;
    uint8_t discover;
});

typedef struct sl_bt_cmd_legacy_advertiser_generate_data_s sl_bt_cmd_legacy_advertiser_generate_data_t;


PACKSTRUCT( struct sl_bt_cmd_legacy_advertiser_start_s
{
    uint8_t advertising_set;
    uint8_t connect;
});

typedef struct sl_bt_cmd_legacy_advertiser_start_s sl_bt_cmd_legacy_advertiser_start_t;


PACKSTRUCT( struct sl_bt_cmd_legacy_advertiser_start_directed_s
{
    uint8_t advertising_set;
    uint8_t connect;
    bd_addr peer_addr;
    uint8_t peer_addr_type;
});

typedef struct sl_bt_cmd_legacy_advertiser_start_directed_s sl_bt_cmd_legacy_advertiser_start_directed_t;


PACKSTRUCT( struct sl_bt_cmd_extended_advertiser_set_phy_s
{
    uint8_t advertising_set;
    uint8_t primary_phy;
    uint8_t secondary_phy;
});

typedef struct sl_bt_cmd_extended_advertiser_set_phy_s sl_bt_cmd_extended_advertiser_set_phy_t;


