SiliconLabsSoftware/boltON/NXP/ncp_host_MCXA156/source/sli_bt_api.h
PACKSTRUCT( struct sl_bt_cmd_extended_advertiser_set_data_s
{
    uint8_t advertising_set;
    uint8array data;
});

typedef struct sl_bt_cmd_extended_advertiser_set_data_s sl_bt_cmd_extended_advertiser_set_data_t;


PACKSTRUCT( struct sl_bt_cmd_extended_advertiser_set_long_data_s
{
    uint8_t advertising_set;
});

typedef struct sl_bt_cmd_extended_advertiser_set_long_data_s sl_bt_cmd_extended_advertiser_set_long_data_t;


PACKSTRUCT( struct sl_bt_cmd_extended_advertiser_generate_data_s
{
    uint8_t advertising_set;
    uint8_t discover;
});

typedef struct sl_bt_cmd_extended_advertiser_generate_data_s sl_bt_cmd_extended_advertiser_generate_data_t;


PACKSTRUCT( struct sl_bt_cmd_extended_advertiser_start_s
{
    uint8_t advertising_set;
    uint8_t connect;
    uint32_t flags;
});

typedef struct sl_bt_cmd_extended_advertiser_start_s sl_bt_cmd_extended_advertiser_start_t;


PACKSTRUCT( struct sl_bt_cmd_extended_advertiser_start_directed_s
{
    uint8_t advertising_set;
    uint8_t connect;
    uint32_t flags;
    bd_addr peer_addr;
    uint8_t peer_addr_type;
});

typedef struct sl_bt_cmd_extended_advertiser_start_directed_s sl_bt_cmd_extended_advertiser_start_directed_t;


PACKSTRUCT( struct sl_bt_cmd_periodic_advertiser_set_data_s
{
    uint8_t advertising_set;
    uint8array data;
});

typedef struct sl_bt_cmd_periodic_advertiser_set_data_s sl_bt_cmd_periodic_advertiser_set_data_t;


PACKSTRUCT( struct sl_bt_cmd_periodic_advertiser_set_long_data_s
{
    uint8_t advertising_set;
});

typedef struct sl_bt_cmd_periodic_advertiser_set_long_data_s sl_bt_cmd_periodic_advertiser_set_long_data_t;


PACKSTRUCT( struct sl_bt_cmd_periodic_advertiser_start_s
{
    uint8_t advertising_set;
    uint16_t interval_min;
    uint16_t interval_max;
    uint32_t flags;
});

typedef struct sl_bt_cmd_periodic_advertiser_start_s sl_bt_cmd_periodic_advertiser_start_t;


PACKSTRUCT( struct sl_bt_cmd_periodic_advertiser_stop_s
{
    uint8_t advertising_set;
});

typedef struct sl_bt_cmd_periodic_advertiser_stop_s sl_bt_cmd_periodic_advertiser_stop_t;


PACKSTRUCT( struct sl_bt_cmd_scanner_set_parameters_s
{
    uint8_t mode;
    uint16_t interval;
    uint16_t window;
});

typedef struct sl_bt_cmd_scanner_set_parameters_s sl_bt_cmd_scanner_set_parameters_t;


PACKSTRUCT( struct sl_bt_cmd_scanner_set_parameters_and_filter_s
{
    uint8_t mode;
    uint16_t interval;
    uint16_t window;
    uint32_t flags;
    uint8_t filter_policy;
});

typedef struct sl_bt_cmd_scanner_set_parameters_and_filter_s sl_bt_cmd_scanner_set_parameters_and_filter_t;


PACKSTRUCT( struct sl_bt_cmd_scanner_start_s
{
    uint8_t scanning_phy;
    uint8_t discover_mode;
});

typedef struct sl_bt_cmd_scanner_start_s sl_bt_cmd_scanner_start_t;


PACKSTRUCT( struct sl_bt_cmd_sync_set_reporting_mode_s
{
    uint16_t sync;
    uint8_t reporting_mode;
});

typedef struct sl_bt_cmd_sync_set_reporting_mode_s sl_bt_cmd_sync_set_reporting_mode_t;


PACKSTRUCT( struct sl_bt_cmd_sync_update_sync_parameters_s
{
    uint16_t sync;
    uint16_t skip;
    uint16_t timeout;
});

typedef struct sl_bt_cmd_sync_update_sync_parameters_s sl_bt_cmd_sync_update_sync_parameters_t;


PACKSTRUCT( struct sl_bt_cmd_sync_close_s
{
    uint16_t sync;
});

typedef struct sl_bt_cmd_sync_close_s sl_bt_cmd_sync_close_t;


PACKSTRUCT( struct sl_bt_cmd_sync_scanner_set_sync_parameters_s
{
    uint16_t skip;
    uint16_t timeout;
    uint8_t reporting_mode;
});

typedef struct sl_bt_cmd_sync_scanner_set_sync_parameters_s sl_bt_cmd_sync_scanner_set_sync_parameters_t;


PACKSTRUCT( struct sl_bt_cmd_sync_scanner_open_s
{
    bd_addr address;
    uint8_t address_type;
    uint8_t adv_sid;
});

typedef struct sl_bt_cmd_sync_scanner_open_s sl_bt_cmd_sync_scanner_open_t;


PACKSTRUCT( struct sl_bt_cmd_past_receiver_set_default_sync_receive_parameters_s
{
    uint8_t mode;
    uint16_t skip;
    uint16_t timeout;
    uint8_t reporting_mode;
});

typedef struct sl_bt_cmd_past_receiver_set_default_sync_receive_parameters_s sl_bt_cmd_past_receiver_set_default_sync_receive_parameters_t;


PACKSTRUCT( struct sl_bt_cmd_past_receiver_set_sync_receive_parameters_s
{
    uint8_t connection;
    uint8_t mode;
    uint16_t skip;
    uint16_t timeout;
    uint8_t reporting_mode;
});

typedef struct sl_bt_cmd_past_receiver_set_sync_receive_parameters_s sl_bt_cmd_past_receiver_set_sync_receive_parameters_t;


PACKSTRUCT( struct sl_bt_cmd_advertiser_past_transfer_s
{
    uint8_t connection;
    uint16_t service_data;
    uint8_t advertising_set;
});

typedef struct sl_bt_cmd_advertiser_past_transfer_s sl_bt_cmd_advertiser_past_transfer_t;


PACKSTRUCT( struct sl_bt_cmd_sync_past_transfer_s
{
    uint8_t connection;
    uint16_t service_data;
    uint16_t sync;
});

typedef struct sl_bt_cmd_sync_past_transfer_s sl_bt_cmd_sync_past_transfer_t;


PACKSTRUCT( struct sl_bt_cmd_pawr_sync_set_sync_subevents_s
{
    uint16_t sync;
    uint8array subevents;
});

typedef struct sl_bt_cmd_pawr_sync_set_sync_subevents_s sl_bt_cmd_pawr_sync_set_sync_subevents_t;


PACKSTRUCT( struct sl_bt_cmd_pawr_sync_set_response_data_s
{
    uint16_t sync;
    uint16_t request_event;
    uint8_t request_subevent;
    uint8_t response_subevent;
    uint8_t response_slot;
    uint8array response_data;
});

typedef struct sl_bt_cmd_pawr_sync_set_response_data_s sl_bt_cmd_pawr_sync_set_response_data_t;


PACKSTRUCT( struct sl_bt_cmd_pawr_advertiser_start_s
{
    uint8_t advertising_set;
    uint16_t interval_min;
    uint16_t interval_max;
    uint32_t flags;
    uint8_t num_subevents;
    uint8_t subevent_interval;
    uint8_t response_slot_delay;
    uint8_t response_slot_spacing;
    uint8_t response_slots;
});

typedef struct sl_bt_cmd_pawr_advertiser_start_s sl_bt_cmd_pawr_advertiser_start_t;


PACKSTRUCT( struct sl_bt_cmd_pawr_advertiser_set_subevent_data_s
{
    uint8_t advertising_set;
    uint8_t subevent;
    uint8_t response_slot_start;
    uint8_t response_slot_count;
    uint8array adv_data;
});

typedef struct sl_bt_cmd_pawr_advertiser_set_subevent_data_s sl_bt_cmd_pawr_advertiser_set_subevent_data_t;


PACKSTRUCT( struct sl_bt_cmd_pawr_advertiser_create_connection_s
{
    uint8_t advertising_set;
    uint8_t subevent;
    bd_addr address;
    uint8_t address_type;
});

typedef struct sl_bt_cmd_pawr_advertiser_create_connection_s sl_bt_cmd_pawr_advertiser_create_connection_t;


PACKSTRUCT( struct sl_bt_cmd_pawr_advertiser_stop_s
{
    uint8_t advertising_set;
});

typedef struct sl_bt_cmd_pawr_advertiser_stop_s sl_bt_cmd_pawr_advertiser_stop_t;


