SiliconLabsSoftware/boltON/NXP/ncp_host_MCXA156/source/sli_bt_api.h
PACKSTRUCT( struct sl_bt_cmd_connection_set_default_parameters_s
{
    uint16_t min_interval;
    uint16_t max_interval;
    uint16_t latency;
    uint16_t timeout;
    uint16_t min_ce_length;
    uint16_t max_ce_length;
});

typedef struct sl_bt_cmd_connection_set_default_parameters_s sl_bt_cmd_connection_set_default_parameters_t;


PACKSTRUCT( struct sl_bt_cmd_connection_set_default_preferred_phy_s
{
    uint8_t preferred_phy;
    uint8_t accepted_phy;
});

typedef struct sl_bt_cmd_connection_set_default_preferred_phy_s sl_bt_cmd_connection_set_default_preferred_phy_t;


PACKSTRUCT( struct sl_bt_cmd_connection_set_default_data_length_s
{
    uint16_t tx_data_len;
});

typedef struct sl_bt_cmd_connection_set_default_data_length_s sl_bt_cmd_connection_set_default_data_length_t;


PACKSTRUCT( struct sl_bt_cmd_connection_set_default_acceptable_subrate_s
{
    uint16_t min_subrate;
    uint16_t max_subrate;
    uint16_t max_latency;
    uint16_t continuation_number;
    uint16_t max_timeout;
});

typedef struct sl_bt_cmd_connection_set_default_acceptable_subrate_s sl_bt_cmd_connection_set_default_acceptable_subrate_t;


PACKSTRUCT( struct sl_bt_cmd_connection_open_s
{
    bd_addr address;
    uint8_t address_type;
    uint8_t initiating_phy;
});

typedef struct sl_bt_cmd_connection_open_s sl_bt_cmd_connection_open_t;


PACKSTRUCT( struct sl_bt_cmd_connection_open_with_accept_list_s
{
    uint8_t initiating_phy;
});

typedef struct sl_bt_cmd_connection_open_with_accept_list_s sl_bt_cmd_connection_open_with_accept_list_t;


PACKSTRUCT( struct sl_bt_cmd_connection_set_parameters_s
{
    uint8_t connection;
    uint16_t min_interval;
    uint16_t max_interval;
    uint16_t latency;
    uint16_t timeout;
    uint16_t min_ce_length;
    uint16_t max_ce_length;
});

typedef struct sl_bt_cmd_connection_set_parameters_s sl_bt_cmd_connection_set_parameters_t;


PACKSTRUCT( struct sl_bt_cmd_connection_set_preferred_phy_s
{
    uint8_t connection;
    uint8_t preferred_phy;
    uint8_t accepted_phy;
});

typedef struct sl_bt_cmd_connection_set_preferred_phy_s sl_bt_cmd_connection_set_preferred_phy_t;


PACKSTRUCT( struct sl_bt_cmd_connection_disable_slave_latency_s
{
    uint8_t connection;
    uint8_t disable;
});

typedef struct sl_bt_cmd_connection_disable_slave_latency_s sl_bt_cmd_connection_disable_slave_latency_t;


PACKSTRUCT( struct sl_bt_cmd_connection_get_median_rssi_s
{
    uint8_t connection;
});

typedef struct sl_bt_cmd_connection_get_median_rssi_s sl_bt_cmd_connection_get_median_rssi_t;


PACKSTRUCT( struct sl_bt_cmd_connection_read_channel_map_s
{
    uint8_t connection;
});

typedef struct sl_bt_cmd_connection_read_channel_map_s sl_bt_cmd_connection_read_channel_map_t;


PACKSTRUCT( struct sl_bt_cmd_connection_set_power_reporting_s
{
    uint8_t connection;
    uint8_t mode;
});

typedef struct sl_bt_cmd_connection_set_power_reporting_s sl_bt_cmd_connection_set_power_reporting_t;


PACKSTRUCT( struct sl_bt_cmd_connection_set_remote_power_reporting_s
{
    uint8_t connection;
    uint8_t mode;
});

typedef struct sl_bt_cmd_connection_set_remote_power_reporting_s sl_bt_cmd_connection_set_remote_power_reporting_t;


PACKSTRUCT( struct sl_bt_cmd_connection_get_tx_power_s
{
    uint8_t connection;
    uint8_t phy;
});

typedef struct sl_bt_cmd_connection_get_tx_power_s sl_bt_cmd_connection_get_tx_power_t;


PACKSTRUCT( struct sl_bt_cmd_connection_get_remote_tx_power_s
{
    uint8_t connection;
    uint8_t phy;
});

typedef struct sl_bt_cmd_connection_get_remote_tx_power_s sl_bt_cmd_connection_get_remote_tx_power_t;


PACKSTRUCT( struct sl_bt_cmd_connection_set_tx_power_s
{
    uint8_t connection;
    int16_t tx_power;
});

typedef struct sl_bt_cmd_connection_set_tx_power_s sl_bt_cmd_connection_set_tx_power_t;


PACKSTRUCT( struct sl_bt_cmd_connection_read_remote_used_features_s
{
    uint8_t connection;
});

typedef struct sl_bt_cmd_connection_read_remote_used_features_s sl_bt_cmd_connection_read_remote_used_features_t;


PACKSTRUCT( struct sl_bt_cmd_connection_get_security_status_s
{
    uint8_t connection;
});

typedef struct sl_bt_cmd_connection_get_security_status_s sl_bt_cmd_connection_get_security_status_t;


PACKSTRUCT( struct sl_bt_cmd_connection_set_data_length_s
{
    uint8_t connection;
    uint16_t tx_data_len;
    uint16_t tx_time_us;
});

typedef struct sl_bt_cmd_connection_set_data_length_s sl_bt_cmd_connection_set_data_length_t;


PACKSTRUCT( struct sl_bt_cmd_connection_read_statistics_s
{
    uint8_t connection;
    uint8_t reset;
});

typedef struct sl_bt_cmd_connection_read_statistics_s sl_bt_cmd_connection_read_statistics_t;


PACKSTRUCT( struct sl_bt_cmd_connection_get_scheduling_details_s
{
    uint8_t connection;
});

typedef struct sl_bt_cmd_connection_get_scheduling_details_s sl_bt_cmd_connection_get_scheduling_details_t;


PACKSTRUCT( struct sl_bt_cmd_connection_get_remote_address_s
{
    uint8_t connection;
});

typedef struct sl_bt_cmd_connection_get_remote_address_s sl_bt_cmd_connection_get_remote_address_t;


PACKSTRUCT( struct sl_bt_cmd_connection_request_subrate_s
{
    uint8_t connection;
    uint16_t min_subrate;
    uint16_t max_subrate;
    uint16_t max_latency;
    uint16_t continuation_number;
    uint16_t timeout;
});

typedef struct sl_bt_cmd_connection_request_subrate_s sl_bt_cmd_connection_request_subrate_t;


PACKSTRUCT( struct sl_bt_cmd_connection_get_state_s
{
    uint8_t connection;
});

typedef struct sl_bt_cmd_connection_get_state_s sl_bt_cmd_connection_get_state_t;


PACKSTRUCT( struct sl_bt_cmd_connection_close_s
{
    uint8_t connection;
});

typedef struct sl_bt_cmd_connection_close_s sl_bt_cmd_connection_close_t;


PACKSTRUCT( struct sl_bt_cmd_connection_forcefully_close_s
{
    uint8_t connection;
});

typedef struct sl_bt_cmd_connection_forcefully_close_s sl_bt_cmd_connection_forcefully_close_t;


PACKSTRUCT( struct sl_bt_cmd_gatt_set_max_mtu_s
{
    uint16_t max_mtu;
});

typedef struct sl_bt_cmd_gatt_set_max_mtu_s sl_bt_cmd_gatt_set_max_mtu_t;


