SiliconLabsSoftware/boltON/NXP/ncp_host_MCXA156/source/sli_bt_api.h
PACKSTRUCT( struct sl_bt_cmd_gatt_discover_primary_services_s
{
    uint8_t connection;
});

typedef struct sl_bt_cmd_gatt_discover_primary_services_s sl_bt_cmd_gatt_discover_primary_services_t;


PACKSTRUCT( struct sl_bt_cmd_gatt_discover_primary_services_by_uuid_s
{
    uint8_t connection;
    uint8array uuid;
});

typedef struct sl_bt_cmd_gatt_discover_primary_services_by_uuid_s sl_bt_cmd_gatt_discover_primary_services_by_uuid_t;


PACKSTRUCT( struct sl_bt_cmd_gatt_find_included_services_s
{
    uint8_t connection;
    uint32_t service;
});

typedef struct sl_bt_cmd_gatt_find_included_services_s sl_bt_cmd_gatt_find_included_services_t;


PACKSTRUCT( struct sl_bt_cmd_gatt_discover_characteristics_s
{
    uint8_t connection;
    uint32_t service;
});

typedef struct sl_bt_cmd_gatt_discover_characteristics_s sl_bt_cmd_gatt_discover_characteristics_t;


PACKSTRUCT( struct sl_bt_cmd_gatt_discover_characteristics_by_uuid_s
{
    uint8_t connection;
    uint32_t service;
    uint8array uuid;
});

typedef struct sl_bt_cmd_gatt_discover_characteristics_by_uuid_s sl_bt_cmd_gatt_discover_characteristics_by_uuid_t;


PACKSTRUCT( struct sl_bt_cmd_gatt_discover_descriptors_s
{
    uint8_t connection;
    uint16_t characteristic;
});

typedef struct sl_bt_cmd_gatt_discover_descriptors_s sl_bt_cmd_gatt_discover_descriptors_t;


PACKSTRUCT( struct sl_bt_cmd_gatt_discover_characteristic_descriptors_s
{
    uint8_t connection;
    uint16_t start;
    uint16_t end;
});

typedef struct sl_bt_cmd_gatt_discover_characteristic_descriptors_s sl_bt_cmd_gatt_discover_characteristic_descriptors_t;


PACKSTRUCT( struct sl_bt_cmd_gatt_set_characteristic_notification_s
{
    uint8_t connection;
    uint16_t characteristic;
    uint8_t flags;
});

typedef struct sl_bt_cmd_gatt_set_characteristic_notification_s sl_bt_cmd_gatt_set_characteristic_notification_t;


PACKSTRUCT( struct sl_bt_cmd_gatt_send_characteristic_confirmation_s
{
    uint8_t connection;
});

typedef struct sl_bt_cmd_gatt_send_characteristic_confirmation_s sl_bt_cmd_gatt_send_characteristic_confirmation_t;


PACKSTRUCT( struct sl_bt_cmd_gatt_read_characteristic_value_s
{
    uint8_t connection;
    uint16_t characteristic;
});

typedef struct sl_bt_cmd_gatt_read_characteristic_value_s sl_bt_cmd_gatt_read_characteristic_value_t;


PACKSTRUCT( struct sl_bt_cmd_gatt_read_characteristic_value_from_offset_s
{
    uint8_t connection;
    uint16_t characteristic;
    uint16_t offset;
    uint16_t maxlen;
});

typedef struct sl_bt_cmd_gatt_read_characteristic_value_from_offset_s sl_bt_cmd_gatt_read_characteristic_value_from_offset_t;


PACKSTRUCT( struct sl_bt_cmd_gatt_read_multiple_characteristic_values_s
{
    uint8_t connection;
    uint8array characteristic_list;
});

typedef struct sl_bt_cmd_gatt_read_multiple_characteristic_values_s sl_bt_cmd_gatt_read_multiple_characteristic_values_t;


PACKSTRUCT( struct sl_bt_cmd_gatt_read_variable_length_characteristic_values_s
{
    uint8_t connection;
    uint8array characteristic_list;
});

typedef struct sl_bt_cmd_gatt_read_variable_length_characteristic_values_s sl_bt_cmd_gatt_read_variable_length_characteristic_values_t;


PACKSTRUCT( struct sl_bt_cmd_gatt_read_characteristic_value_by_uuid_s
{
    uint8_t connection;
    uint32_t service;
    uint8array uuid;
});

typedef struct sl_bt_cmd_gatt_read_characteristic_value_by_uuid_s sl_bt_cmd_gatt_read_characteristic_value_by_uuid_t;


PACKSTRUCT( struct sl_bt_cmd_gatt_write_characteristic_value_s
{
    uint8_t connection;
    uint16_t characteristic;
    uint8array value;
});

typedef struct sl_bt_cmd_gatt_write_characteristic_value_s sl_bt_cmd_gatt_write_characteristic_value_t;


PACKSTRUCT( struct sl_bt_cmd_gatt_write_characteristic_value_without_response_s
{
    uint8_t connection;
    uint16_t characteristic;
    uint8array value;
});

typedef struct sl_bt_cmd_gatt_write_characteristic_value_without_response_s sl_bt_cmd_gatt_write_characteristic_value_without_response_t;


PACKSTRUCT( struct sl_bt_cmd_gatt_prepare_characteristic_value_write_s
{
    uint8_t connection;
    uint16_t characteristic;
    uint16_t offset;
    uint8array value;
});

typedef struct sl_bt_cmd_gatt_prepare_characteristic_value_write_s sl_bt_cmd_gatt_prepare_characteristic_value_write_t;


PACKSTRUCT( struct sl_bt_cmd_gatt_prepare_characteristic_value_reliable_write_s
{
    uint8_t connection;
    uint16_t characteristic;
    uint16_t offset;
    uint8array value;
});

typedef struct sl_bt_cmd_gatt_prepare_characteristic_value_reliable_write_s sl_bt_cmd_gatt_prepare_characteristic_value_reliable_write_t;


PACKSTRUCT( struct sl_bt_cmd_gatt_execute_characteristic_value_write_s
{
    uint8_t connection;
    uint8_t flags;
});

typedef struct sl_bt_cmd_gatt_execute_characteristic_value_write_s sl_bt_cmd_gatt_execute_characteristic_value_write_t;


PACKSTRUCT( struct sl_bt_cmd_gatt_read_descriptor_value_s
{
    uint8_t connection;
    uint16_t descriptor;
});

typedef struct sl_bt_cmd_gatt_read_descriptor_value_s sl_bt_cmd_gatt_read_descriptor_value_t;


PACKSTRUCT( struct sl_bt_cmd_gatt_write_descriptor_value_s
{
    uint8_t connection;
    uint16_t descriptor;
    uint8array value;
});

typedef struct sl_bt_cmd_gatt_write_descriptor_value_s sl_bt_cmd_gatt_write_descriptor_value_t;


PACKSTRUCT( struct sl_bt_cmd_gatt_get_mtu_s
{
    uint8_t connection;
});

typedef struct sl_bt_cmd_gatt_get_mtu_s sl_bt_cmd_gatt_get_mtu_t;


PACKSTRUCT( struct sl_bt_cmd_gattdb_add_service_s
{
    uint16_t session;
    uint8_t type;
    uint8_t property;
    uint8array uuid;
});

typedef struct sl_bt_cmd_gattdb_add_service_s sl_bt_cmd_gattdb_add_service_t;


PACKSTRUCT( struct sl_bt_cmd_gattdb_remove_service_s
{
    uint16_t session;
    uint16_t service;
});

typedef struct sl_bt_cmd_gattdb_remove_service_s sl_bt_cmd_gattdb_remove_service_t;


PACKSTRUCT( struct sl_bt_cmd_gattdb_add_included_service_s
{
    uint16_t session;
    uint16_t service;
    uint16_t included_service;
});

typedef struct sl_bt_cmd_gattdb_add_included_service_s sl_bt_cmd_gattdb_add_included_service_t;


PACKSTRUCT( struct sl_bt_cmd_gattdb_remove_included_service_s
{
    uint16_t session;
    uint16_t attribute;
});

typedef struct sl_bt_cmd_gattdb_remove_included_service_s sl_bt_cmd_gattdb_remove_included_service_t;


PACKSTRUCT( struct sl_bt_cmd_gattdb_add_uuid16_characteristic_s
{
    uint16_t session;
    uint16_t service;
    uint16_t property;
    uint16_t security;
    uint8_t flag;
    sl_bt_uuid_16_t uuid;
    uint8_t value_type;
    uint16_t maxlen;
    byte_array value;
});

typedef struct sl_bt_cmd_gattdb_add_uuid16_characteristic_s sl_bt_cmd_gattdb_add_uuid16_characteristic_t;


