SiliconLabsSoftware/boltON/NXP/ncp_host_MCXA156/source/sli_bt_api.h
PACKSTRUCT( struct sl_bt_cmd_gattdb_add_uuid128_characteristic_s
{
    uint16_t session;
    uint16_t service;
    uint16_t property;
    uint16_t security;
    uint8_t flag;
    uuid_128 uuid;
    uint8_t value_type;
    uint16_t maxlen;
    byte_array value;
});

typedef struct sl_bt_cmd_gattdb_add_uuid128_characteristic_s sl_bt_cmd_gattdb_add_uuid128_characteristic_t;


PACKSTRUCT( struct sl_bt_cmd_gattdb_remove_characteristic_s
{
    uint16_t session;
    uint16_t characteristic;
});

typedef struct sl_bt_cmd_gattdb_remove_characteristic_s sl_bt_cmd_gattdb_remove_characteristic_t;


PACKSTRUCT( struct sl_bt_cmd_gattdb_add_uuid16_descriptor_s
{
    uint16_t session;
    uint16_t characteristic;
    uint16_t property;
    uint16_t security;
    sl_bt_uuid_16_t uuid;
    uint8_t value_type;
    uint16_t maxlen;
    byte_array value;
});

typedef struct sl_bt_cmd_gattdb_add_uuid16_descriptor_s sl_bt_cmd_gattdb_add_uuid16_descriptor_t;


PACKSTRUCT( struct sl_bt_cmd_gattdb_add_uuid128_descriptor_s
{
    uint16_t session;
    uint16_t characteristic;
    uint16_t property;
    uint16_t security;
    uuid_128 uuid;
    uint8_t value_type;
    uint16_t maxlen;
    byte_array value;
});

typedef struct sl_bt_cmd_gattdb_add_uuid128_descriptor_s sl_bt_cmd_gattdb_add_uuid128_descriptor_t;


PACKSTRUCT( struct sl_bt_cmd_gattdb_remove_descriptor_s
{
    uint16_t session;
    uint16_t descriptor;
});

typedef struct sl_bt_cmd_gattdb_remove_descriptor_s sl_bt_cmd_gattdb_remove_descriptor_t;


PACKSTRUCT( struct sl_bt_cmd_gattdb_start_service_s
{
    uint16_t session;
    uint16_t service;
});

typedef struct sl_bt_cmd_gattdb_start_service_s sl_bt_cmd_gattdb_start_service_t;


PACKSTRUCT( struct sl_bt_cmd_gattdb_stop_service_s
{
    uint16_t session;
    uint16_t service;
});

typedef struct sl_bt_cmd_gattdb_stop_service_s sl_bt_cmd_gattdb_stop_service_t;


PACKSTRUCT( struct sl_bt_cmd_gattdb_start_characteristic_s
{
    uint16_t session;
    uint16_t characteristic;
});

typedef struct sl_bt_cmd_gattdb_start_characteristic_s sl_bt_cmd_gattdb_start_characteristic_t;


PACKSTRUCT( struct sl_bt_cmd_gattdb_stop_characteristic_s
{
    uint16_t session;
    uint16_t characteristic;
});

typedef struct sl_bt_cmd_gattdb_stop_characteristic_s sl_bt_cmd_gattdb_stop_characteristic_t;


PACKSTRUCT( struct sl_bt_cmd_gattdb_commit_s
{
    uint16_t session;
});

typedef struct sl_bt_cmd_gattdb_commit_s sl_bt_cmd_gattdb_commit_t;


PACKSTRUCT( struct sl_bt_cmd_gattdb_abort_s
{
    uint16_t session;
});

typedef struct sl_bt_cmd_gattdb_abort_s sl_bt_cmd_gattdb_abort_t;


PACKSTRUCT( struct sl_bt_cmd_gattdb_get_attribute_state_s
{
    uint16_t attribute;
});

typedef struct sl_bt_cmd_gattdb_get_attribute_state_s sl_bt_cmd_gattdb_get_attribute_state_t;


PACKSTRUCT( struct sl_bt_cmd_gatt_server_set_max_mtu_s
{
    uint16_t max_mtu;
});

typedef struct sl_bt_cmd_gatt_server_set_max_mtu_s sl_bt_cmd_gatt_server_set_max_mtu_t;


PACKSTRUCT( struct sl_bt_cmd_gatt_server_get_mtu_s
{
    uint8_t connection;
});

typedef struct sl_bt_cmd_gatt_server_get_mtu_s sl_bt_cmd_gatt_server_get_mtu_t;


PACKSTRUCT( struct sl_bt_cmd_gatt_server_find_attribute_s
{
    uint16_t start;
    uint8array type;
});

typedef struct sl_bt_cmd_gatt_server_find_attribute_s sl_bt_cmd_gatt_server_find_attribute_t;


PACKSTRUCT( struct sl_bt_cmd_gatt_server_find_primary_service_s
{
    uint16_t start;
    uint8array uuid;
});

typedef struct sl_bt_cmd_gatt_server_find_primary_service_s sl_bt_cmd_gatt_server_find_primary_service_t;


PACKSTRUCT( struct sl_bt_cmd_gatt_server_read_attribute_value_s
{
    uint16_t attribute;
    uint16_t offset;
});

typedef struct sl_bt_cmd_gatt_server_read_attribute_value_s sl_bt_cmd_gatt_server_read_attribute_value_t;


PACKSTRUCT( struct sl_bt_cmd_gatt_server_read_attribute_type_s
{
    uint16_t attribute;
});

typedef struct sl_bt_cmd_gatt_server_read_attribute_type_s sl_bt_cmd_gatt_server_read_attribute_type_t;


PACKSTRUCT( struct sl_bt_cmd_gatt_server_read_attribute_properties_s
{
    uint16_t attribute;
});

typedef struct sl_bt_cmd_gatt_server_read_attribute_properties_s sl_bt_cmd_gatt_server_read_attribute_properties_t;


PACKSTRUCT( struct sl_bt_cmd_gatt_server_write_attribute_value_s
{
    uint16_t attribute;
    uint16_t offset;
    uint8array value;
});

typedef struct sl_bt_cmd_gatt_server_write_attribute_value_s sl_bt_cmd_gatt_server_write_attribute_value_t;


PACKSTRUCT( struct sl_bt_cmd_gatt_server_send_user_read_response_s
{
    uint8_t connection;
    uint16_t characteristic;
    uint8_t att_errorcode;
    uint8array value;
});

typedef struct sl_bt_cmd_gatt_server_send_user_read_response_s sl_bt_cmd_gatt_server_send_user_read_response_t;


PACKSTRUCT( struct sl_bt_cmd_gatt_server_send_user_write_response_s
{
    uint8_t connection;
    uint16_t characteristic;
    uint8_t att_errorcode;
});

typedef struct sl_bt_cmd_gatt_server_send_user_write_response_s sl_bt_cmd_gatt_server_send_user_write_response_t;


PACKSTRUCT( struct sl_bt_cmd_gatt_server_send_notification_s
{
    uint8_t connection;
    uint16_t characteristic;
    uint8array value;
});

typedef struct sl_bt_cmd_gatt_server_send_notification_s sl_bt_cmd_gatt_server_send_notification_t;


PACKSTRUCT( struct sl_bt_cmd_gatt_server_send_indication_s
{
    uint8_t connection;
    uint16_t characteristic;
    uint8array value;
});

typedef struct sl_bt_cmd_gatt_server_send_indication_s sl_bt_cmd_gatt_server_send_indication_t;


PACKSTRUCT( struct sl_bt_cmd_gatt_server_notify_all_s
{
    uint16_t characteristic;
    uint8array value;
});

typedef struct sl_bt_cmd_gatt_server_notify_all_s sl_bt_cmd_gatt_server_notify_all_t;


PACKSTRUCT( struct sl_bt_cmd_gatt_server_read_client_configuration_s
{
    uint8_t connection;
    uint16_t characteristic;
});

typedef struct sl_bt_cmd_gatt_server_read_client_configuration_s sl_bt_cmd_gatt_server_read_client_configuration_t;


PACKSTRUCT( struct sl_bt_cmd_gatt_server_send_user_prepare_write_response_s
{
    uint8_t connection;
    uint16_t characteristic;
    uint8_t att_errorcode;
    uint16_t offset;
    uint8array value;
});

typedef struct sl_bt_cmd_gatt_server_send_user_prepare_write_response_s sl_bt_cmd_gatt_server_send_user_prepare_write_response_t;


PACKSTRUCT( struct sl_bt_cmd_gatt_server_set_capabilities_s
{
    uint32_t caps;
    uint32_t reserved;
});

typedef struct sl_bt_cmd_gatt_server_set_capabilities_s sl_bt_cmd_gatt_server_set_capabilities_t;


PACKSTRUCT( struct sl_bt_cmd_gatt_server_enable_capabilities_s
{
    uint32_t caps;
});

typedef struct sl_bt_cmd_gatt_server_enable_capabilities_s sl_bt_cmd_gatt_server_enable_capabilities_t;


PACKSTRUCT( struct sl_bt_cmd_gatt_server_disable_capabilities_s
{
    uint32_t caps;
});

typedef struct sl_bt_cmd_gatt_server_disable_capabilities_s sl_bt_cmd_gatt_server_disable_capabilities_t;


PACKSTRUCT( struct sl_bt_cmd_gatt_server_read_client_supported_features_s
{
    uint8_t connection;
});

