SiliconLabsSoftware/boltON/NXP/ncp_host_MCXA156/source/sli_bt_api.h
typedef struct sl_bt_cmd_gatt_server_read_client_supported_features_s sl_bt_cmd_gatt_server_read_client_supported_features_t;


PACKSTRUCT( struct sl_bt_cmd_nvm_save_s
{
    uint16_t key;
    uint8array value;
});

typedef struct sl_bt_cmd_nvm_save_s sl_bt_cmd_nvm_save_t;


PACKSTRUCT( struct sl_bt_cmd_nvm_load_s
{
    uint16_t key;
});

typedef struct sl_bt_cmd_nvm_load_s sl_bt_cmd_nvm_load_t;


PACKSTRUCT( struct sl_bt_cmd_nvm_erase_s
{
    uint16_t key;
});

typedef struct sl_bt_cmd_nvm_erase_s sl_bt_cmd_nvm_erase_t;


PACKSTRUCT( struct sl_bt_cmd_test_dtm_tx_v4_s
{
    uint8_t packet_type;
    uint8_t length;
    uint8_t channel;
    uint8_t phy;
    int8_t power_level;
});

typedef struct sl_bt_cmd_test_dtm_tx_v4_s sl_bt_cmd_test_dtm_tx_v4_t;


PACKSTRUCT( struct sl_bt_cmd_test_dtm_tx_cw_s
{
    uint8_t packet_type;
    uint8_t channel;
    uint8_t phy;
    int16_t power_level;
});

typedef struct sl_bt_cmd_test_dtm_tx_cw_s sl_bt_cmd_test_dtm_tx_cw_t;


PACKSTRUCT( struct sl_bt_cmd_test_dtm_rx_s
{
    uint8_t channel;
    uint8_t phy;
});

typedef struct sl_bt_cmd_test_dtm_rx_s sl_bt_cmd_test_dtm_rx_t;


PACKSTRUCT( struct sl_bt_cmd_sm_configure_s
{
    uint8_t flags;
    uint8_t io_capabilities;
});

typedef struct sl_bt_cmd_sm_configure_s sl_bt_cmd_sm_configure_t;


PACKSTRUCT( struct sl_bt_cmd_sm_set_minimum_key_size_s
{
    uint8_t minimum_key_size;
});

typedef struct sl_bt_cmd_sm_set_minimum_key_size_s sl_bt_cmd_sm_set_minimum_key_size_t;


PACKSTRUCT( struct sl_bt_cmd_sm_store_bonding_configuration_s
{
    uint8_t max_bonding_count;
    uint8_t policy_flags;
});

typedef struct sl_bt_cmd_sm_store_bonding_configuration_s sl_bt_cmd_sm_store_bonding_configuration_t;


PACKSTRUCT( struct sl_bt_cmd_sm_set_bondable_mode_s
{
    uint8_t bondable;
});

typedef struct sl_bt_cmd_sm_set_bondable_mode_s sl_bt_cmd_sm_set_bondable_mode_t;


PACKSTRUCT( struct sl_bt_cmd_sm_set_passkey_s
{
    int32_t passkey;
});

typedef struct sl_bt_cmd_sm_set_passkey_s sl_bt_cmd_sm_set_passkey_t;


PACKSTRUCT( struct sl_bt_cmd_sm_increase_security_s
{
    uint8_t connection;
});

typedef struct sl_bt_cmd_sm_increase_security_s sl_bt_cmd_sm_increase_security_t;


PACKSTRUCT( struct sl_bt_cmd_sm_enter_passkey_s
{
    uint8_t connection;
    int32_t passkey;
});

typedef struct sl_bt_cmd_sm_enter_passkey_s sl_bt_cmd_sm_enter_passkey_t;


PACKSTRUCT( struct sl_bt_cmd_sm_passkey_confirm_s
{
    uint8_t connection;
    uint8_t confirm;
});

typedef struct sl_bt_cmd_sm_passkey_confirm_s sl_bt_cmd_sm_passkey_confirm_t;


PACKSTRUCT( struct sl_bt_cmd_sm_bonding_confirm_s
{
    uint8_t connection;
    uint8_t confirm;
});

typedef struct sl_bt_cmd_sm_bonding_confirm_s sl_bt_cmd_sm_bonding_confirm_t;


PACKSTRUCT( struct sl_bt_cmd_sm_delete_bonding_s
{
    uint8_t bonding;
});

typedef struct sl_bt_cmd_sm_delete_bonding_s sl_bt_cmd_sm_delete_bonding_t;


PACKSTRUCT( struct sl_bt_cmd_sm_get_bonding_handles_s
{
    uint32_t reserved;
});

typedef struct sl_bt_cmd_sm_get_bonding_handles_s sl_bt_cmd_sm_get_bonding_handles_t;


PACKSTRUCT( struct sl_bt_cmd_sm_get_bonding_details_s
{
    uint32_t bonding;
});

typedef struct sl_bt_cmd_sm_get_bonding_details_s sl_bt_cmd_sm_get_bonding_details_t;


PACKSTRUCT( struct sl_bt_cmd_sm_find_bonding_by_address_s
{
    bd_addr address;
});

typedef struct sl_bt_cmd_sm_find_bonding_by_address_s sl_bt_cmd_sm_find_bonding_by_address_t;


PACKSTRUCT( struct sl_bt_cmd_sm_resolve_rpa_s
{
    bd_addr rpa;
});

typedef struct sl_bt_cmd_sm_resolve_rpa_s sl_bt_cmd_sm_resolve_rpa_t;


PACKSTRUCT( struct sl_bt_cmd_sm_set_bonding_key_s
{
    uint32_t bonding;
    uint8_t key_type;
    aes_key_128 key;
});

typedef struct sl_bt_cmd_sm_set_bonding_key_s sl_bt_cmd_sm_set_bonding_key_t;


PACKSTRUCT( struct sl_bt_cmd_sm_set_legacy_oob_s
{
    uint8_t enable;
    aes_key_128 oob_data;
});

typedef struct sl_bt_cmd_sm_set_legacy_oob_s sl_bt_cmd_sm_set_legacy_oob_t;


PACKSTRUCT( struct sl_bt_cmd_sm_set_oob_s
{
    uint8_t enable;
});

typedef struct sl_bt_cmd_sm_set_oob_s sl_bt_cmd_sm_set_oob_t;


PACKSTRUCT( struct sl_bt_cmd_sm_set_remote_oob_s
{
    uint8_t enable;
    aes_key_128 random;
    aes_key_128 confirm;
});

typedef struct sl_bt_cmd_sm_set_remote_oob_s sl_bt_cmd_sm_set_remote_oob_t;


PACKSTRUCT( struct sl_bt_cmd_external_bondingdb_set_data_s
{
    uint8_t connection;
    uint8_t type;
    uint8array data;
});

typedef struct sl_bt_cmd_external_bondingdb_set_data_s sl_bt_cmd_external_bondingdb_set_data_t;


PACKSTRUCT( struct sl_bt_cmd_resolving_list_add_device_by_bonding_s
{
    uint32_t bonding;
    uint8_t privacy_mode;
});

typedef struct sl_bt_cmd_resolving_list_add_device_by_bonding_s sl_bt_cmd_resolving_list_add_device_by_bonding_t;


PACKSTRUCT( struct sl_bt_cmd_resolving_list_add_device_by_address_s
{
    bd_addr address;
    uint8_t address_type;
    aes_key_128 key;
    uint8_t privacy_mode;
});

typedef struct sl_bt_cmd_resolving_list_add_device_by_address_s sl_bt_cmd_resolving_list_add_device_by_address_t;


PACKSTRUCT( struct sl_bt_cmd_resolving_list_remove_device_by_bonding_s
{
    uint32_t bonding;
});

typedef struct sl_bt_cmd_resolving_list_remove_device_by_bonding_s sl_bt_cmd_resolving_list_remove_device_by_bonding_t;


PACKSTRUCT( struct sl_bt_cmd_resolving_list_remove_device_by_address_s
{
    bd_addr address;
    uint8_t address_type;
});

typedef struct sl_bt_cmd_resolving_list_remove_device_by_address_s sl_bt_cmd_resolving_list_remove_device_by_address_t;


PACKSTRUCT( struct sl_bt_cmd_accept_list_add_device_by_bonding_s
{
    uint32_t bonding;
});

typedef struct sl_bt_cmd_accept_list_add_device_by_bonding_s sl_bt_cmd_accept_list_add_device_by_bonding_t;


PACKSTRUCT( struct sl_bt_cmd_accept_list_add_device_by_address_s
{
    bd_addr address;
    uint8_t address_type;
});

typedef struct sl_bt_cmd_accept_list_add_device_by_address_s sl_bt_cmd_accept_list_add_device_by_address_t;


PACKSTRUCT( struct sl_bt_cmd_accept_list_remove_device_by_bonding_s
{
    uint32_t bonding;
});

typedef struct sl_bt_cmd_accept_list_remove_device_by_bonding_s sl_bt_cmd_accept_list_remove_device_by_bonding_t;


PACKSTRUCT( struct sl_bt_cmd_accept_list_remove_device_by_address_s
{
    bd_addr address;
    uint8_t address_type;
});

typedef struct sl_bt_cmd_accept_list_remove_device_by_address_s sl_bt_cmd_accept_list_remove_device_by_address_t;


