SiliconLabsSoftware/boltON/NXP/ncp_host_MCXA156/source/sli_bt_api.h
PACKSTRUCT( struct sl_bt_cmd_coex_set_options_s
{
    uint32_t mask;
    uint32_t options;
});

typedef struct sl_bt_cmd_coex_set_options_s sl_bt_cmd_coex_set_options_t;


PACKSTRUCT( struct sl_bt_cmd_coex_set_parameters_s
{
    uint8_t priority;
    uint8_t request;
    uint8_t pwm_period;
    uint8_t pwm_dutycycle;
});

typedef struct sl_bt_cmd_coex_set_parameters_s sl_bt_cmd_coex_set_parameters_t;


PACKSTRUCT( struct sl_bt_cmd_coex_set_directional_priority_pulse_s
{
    uint8_t pulse;
});

typedef struct sl_bt_cmd_coex_set_directional_priority_pulse_s sl_bt_cmd_coex_set_directional_priority_pulse_t;


PACKSTRUCT( struct sl_bt_cmd_coex_get_counters_s
{
    uint8_t reset;
});

typedef struct sl_bt_cmd_coex_get_counters_s sl_bt_cmd_coex_get_counters_t;


PACKSTRUCT( struct sl_bt_cmd_cs_security_enable_s
{
    uint8_t connection;
});

typedef struct sl_bt_cmd_cs_security_enable_s sl_bt_cmd_cs_security_enable_t;


PACKSTRUCT( struct sl_bt_cmd_cs_set_default_settings_s
{
    uint8_t connection;
    uint8_t initiator_status;
    uint8_t reflector_status;
    uint8_t antenna_identifier;
    int8_t max_tx_power;
});

typedef struct sl_bt_cmd_cs_set_default_settings_s sl_bt_cmd_cs_set_default_settings_t;


PACKSTRUCT( struct sl_bt_cmd_cs_create_config_s
{
    uint8_t connection;
    uint8_t config_id;
    uint8_t create_context;
    uint8_t main_mode_type;
    uint8_t sub_mode_type;
    uint8_t min_main_mode_steps;
    uint8_t max_main_mode_steps;
    uint8_t main_mode_repetition;
    uint8_t mode_calibration_steps;
    uint8_t role;
    uint8_t rtt_type;
    uint8_t cs_sync_phy;
    sl_bt_cs_channel_map_t channel_map;
    uint8_t channel_map_repetition;
    uint8_t channel_selection_type;
    uint8_t ch3c_shape;
    uint8_t ch3c_jump;
    uint8_t reserved;
});

typedef struct sl_bt_cmd_cs_create_config_s sl_bt_cmd_cs_create_config_t;


PACKSTRUCT( struct sl_bt_cmd_cs_remove_config_s
{
    uint8_t connection;
    uint8_t config_id;
});

typedef struct sl_bt_cmd_cs_remove_config_s sl_bt_cmd_cs_remove_config_t;


PACKSTRUCT( struct sl_bt_cmd_cs_set_channel_classification_s
{
    sl_bt_cs_channel_map_t channel_map;
});

typedef struct sl_bt_cmd_cs_set_channel_classification_s sl_bt_cmd_cs_set_channel_classification_t;


PACKSTRUCT( struct sl_bt_cmd_cs_set_procedure_parameters_s
{
    uint8_t connection;
    uint8_t config_id;
    uint16_t max_procedure_len;
    uint16_t min_procedure_interval;
    uint16_t max_procedure_interval;
    uint16_t max_procedure_count;
    uint32_t min_subevent_len;
    uint32_t max_subevent_len;
    uint8_t tone_antenna_config_selection;
    uint8_t phy;
    int8_t tx_pwr_delta;
    uint8_t preferred_peer_antenna;
    uint8_t snr_control_initiator;
    uint8_t snr_control_reflector;
});

typedef struct sl_bt_cmd_cs_set_procedure_parameters_s sl_bt_cmd_cs_set_procedure_parameters_t;


PACKSTRUCT( struct sl_bt_cmd_cs_procedure_enable_s
{
    uint8_t connection;
    uint8_t enable;
    uint8_t config_id;
});

typedef struct sl_bt_cmd_cs_procedure_enable_s sl_bt_cmd_cs_procedure_enable_t;


PACKSTRUCT( struct sl_bt_cmd_cs_set_antenna_configuration_s
{
    uint8array antenna_element_offset;
});

typedef struct sl_bt_cmd_cs_set_antenna_configuration_s sl_bt_cmd_cs_set_antenna_configuration_t;


PACKSTRUCT( struct sl_bt_cmd_cs_read_remote_supported_capabilities_s
{
    uint8_t connection;
});

typedef struct sl_bt_cmd_cs_read_remote_supported_capabilities_s sl_bt_cmd_cs_read_remote_supported_capabilities_t;


PACKSTRUCT( struct sl_bt_cmd_cs_test_start_s
{
    uint8_t main_mode_type;
    uint8_t sub_mode_type;
    uint8_t main_mode_repetition;
    uint8_t mode_calibration_steps;
    uint8_t role;
    uint8_t rtt_type;
    uint8_t cs_sync_phy;
    uint8_t antenna_selection;
    sl_bt_cs_subevent_length_t subevent_len;
    uint16_t subevent_interval;
    uint8_t max_num_subevents;
    int8_t tx_power;
    uint8_t t_ip1_time;
    uint8_t t_ip2_time;
    uint8_t t_fcs_time;
    uint8_t t_pm_time;
    uint8_t t_sw_time;
    uint8_t tone_antenna_config;
    uint8_t reserved;
    uint8_t snr_control_initiator;
    uint8_t snr_control_reflector;
    uint16_t drbg_nonce;
    uint8_t channel_map_repetition;
    uint16_t override_config;
    uint8array override_parameters;
});

typedef struct sl_bt_cmd_cs_test_start_s sl_bt_cmd_cs_test_start_t;


PACKSTRUCT( struct sl_bt_cmd_l2cap_open_le_channel_s
{
    uint8_t connection;
    uint16_t spsm;
    uint16_t max_sdu;
    uint16_t max_pdu;
    uint16_t credit;
});

typedef struct sl_bt_cmd_l2cap_open_le_channel_s sl_bt_cmd_l2cap_open_le_channel_t;


PACKSTRUCT( struct sl_bt_cmd_l2cap_send_le_channel_open_response_s
{
    uint8_t connection;
    uint16_t cid;
    uint16_t max_sdu;
    uint16_t max_pdu;
    uint16_t credit;
    uint16_t errorcode;
});

typedef struct sl_bt_cmd_l2cap_send_le_channel_open_response_s sl_bt_cmd_l2cap_send_le_channel_open_response_t;


PACKSTRUCT( struct sl_bt_cmd_l2cap_channel_send_data_s
{
    uint8_t connection;
    uint16_t cid;
    uint8array data;
});

typedef struct sl_bt_cmd_l2cap_channel_send_data_s sl_bt_cmd_l2cap_channel_send_data_t;


PACKSTRUCT( struct sl_bt_cmd_l2cap_channel_send_credit_s
{
    uint8_t connection;
    uint16_t cid;
    uint16_t credit;
});

typedef struct sl_bt_cmd_l2cap_channel_send_credit_s sl_bt_cmd_l2cap_channel_send_credit_t;


PACKSTRUCT( struct sl_bt_cmd_l2cap_close_channel_s
{
    uint8_t connection;
    uint16_t cid;
});

typedef struct sl_bt_cmd_l2cap_close_channel_s sl_bt_cmd_l2cap_close_channel_t;


PACKSTRUCT( struct sl_bt_cmd_cte_transmitter_set_dtm_parameters_s
{
    uint8_t cte_length;
    uint8_t cte_type;
    uint8array switching_pattern;
});

typedef struct sl_bt_cmd_cte_transmitter_set_dtm_parameters_s sl_bt_cmd_cte_transmitter_set_dtm_parameters_t;


PACKSTRUCT( struct sl_bt_cmd_cte_transmitter_enable_connection_cte_s
{
    uint8_t connection;
    uint8_t cte_types;
    uint8array switching_pattern;
});

typedef struct sl_bt_cmd_cte_transmitter_enable_connection_cte_s sl_bt_cmd_cte_transmitter_enable_connection_cte_t;


PACKSTRUCT( struct sl_bt_cmd_cte_transmitter_disable_connection_cte_s
{
    uint8_t connection;
});

typedef struct sl_bt_cmd_cte_transmitter_disable_connection_cte_s sl_bt_cmd_cte_transmitter_disable_connection_cte_t;


PACKSTRUCT( struct sl_bt_cmd_cte_transmitter_enable_connectionless_cte_s
{
    uint8_t handle;
    uint8_t cte_length;
    uint8_t cte_type;
    uint8_t cte_count;
    uint8array switching_pattern;
});

typedef struct sl_bt_cmd_cte_transmitter_enable_connectionless_cte_s sl_bt_cmd_cte_transmitter_enable_connectionless_cte_t;


PACKSTRUCT( struct sl_bt_cmd_cte_transmitter_disable_connectionless_cte_s
{
    uint8_t handle;
});

