SiliconLabsSoftware/boltON/NXP/ncp_host_MCXA156/source/sli_bt_api.h
typedef struct sl_bt_cmd_cte_transmitter_disable_connectionless_cte_s sl_bt_cmd_cte_transmitter_disable_connectionless_cte_t;


PACKSTRUCT( struct sl_bt_cmd_cte_transmitter_enable_silabs_cte_s
{
    uint8_t handle;
    uint8_t cte_length;
    uint8_t cte_type;
    uint8_t cte_count;
    uint8array switching_pattern;
});

typedef struct sl_bt_cmd_cte_transmitter_enable_silabs_cte_s sl_bt_cmd_cte_transmitter_enable_silabs_cte_t;


PACKSTRUCT( struct sl_bt_cmd_cte_transmitter_disable_silabs_cte_s
{
    uint8_t handle;
});

typedef struct sl_bt_cmd_cte_transmitter_disable_silabs_cte_s sl_bt_cmd_cte_transmitter_disable_silabs_cte_t;


PACKSTRUCT( struct sl_bt_cmd_cte_receiver_set_dtm_parameters_s
{
    uint8_t cte_length;
    uint8_t cte_type;
    uint8_t slot_durations;
    uint8array switching_pattern;
});

typedef struct sl_bt_cmd_cte_receiver_set_dtm_parameters_s sl_bt_cmd_cte_receiver_set_dtm_parameters_t;


PACKSTRUCT( struct sl_bt_cmd_cte_receiver_set_sync_cte_type_s
{
    uint8_t sync_cte_type;
});

typedef struct sl_bt_cmd_cte_receiver_set_sync_cte_type_s sl_bt_cmd_cte_receiver_set_sync_cte_type_t;


PACKSTRUCT( struct sl_bt_cmd_cte_receiver_set_default_sync_receive_parameters_s
{
    uint8_t mode;
    uint16_t skip;
    uint16_t timeout;
    uint8_t sync_cte_type;
    uint8_t reporting_mode;
});

typedef struct sl_bt_cmd_cte_receiver_set_default_sync_receive_parameters_s sl_bt_cmd_cte_receiver_set_default_sync_receive_parameters_t;


PACKSTRUCT( struct sl_bt_cmd_cte_receiver_set_sync_receive_parameters_s
{
    uint8_t connection;
    uint8_t mode;
    uint16_t skip;
    uint16_t timeout;
    uint8_t sync_cte_type;
    uint8_t reporting_mode;
});

typedef struct sl_bt_cmd_cte_receiver_set_sync_receive_parameters_s sl_bt_cmd_cte_receiver_set_sync_receive_parameters_t;


PACKSTRUCT( struct sl_bt_cmd_cte_receiver_configure_s
{
    uint8_t flags;
});

typedef struct sl_bt_cmd_cte_receiver_configure_s sl_bt_cmd_cte_receiver_configure_t;


PACKSTRUCT( struct sl_bt_cmd_cte_receiver_enable_connection_cte_s
{
    uint8_t connection;
    uint16_t interval;
    uint8_t cte_length;
    uint8_t cte_type;
    uint8_t slot_durations;
    uint8array switching_pattern;
});

typedef struct sl_bt_cmd_cte_receiver_enable_connection_cte_s sl_bt_cmd_cte_receiver_enable_connection_cte_t;


PACKSTRUCT( struct sl_bt_cmd_cte_receiver_disable_connection_cte_s
{
    uint8_t connection;
});

typedef struct sl_bt_cmd_cte_receiver_disable_connection_cte_s sl_bt_cmd_cte_receiver_disable_connection_cte_t;


PACKSTRUCT( struct sl_bt_cmd_cte_receiver_enable_connectionless_cte_s
{
    uint16_t sync;
    uint8_t slot_durations;
    uint8_t cte_count;
    uint8array switching_pattern;
});

typedef struct sl_bt_cmd_cte_receiver_enable_connectionless_cte_s sl_bt_cmd_cte_receiver_enable_connectionless_cte_t;


PACKSTRUCT( struct sl_bt_cmd_cte_receiver_disable_connectionless_cte_s
{
    uint16_t sync;
});

typedef struct sl_bt_cmd_cte_receiver_disable_connectionless_cte_s sl_bt_cmd_cte_receiver_disable_connectionless_cte_t;


PACKSTRUCT( struct sl_bt_cmd_cte_receiver_enable_silabs_cte_s
{
    uint8_t slot_durations;
    uint8_t cte_count;
    uint8array switching_pattern;
});

typedef struct sl_bt_cmd_cte_receiver_enable_silabs_cte_s sl_bt_cmd_cte_receiver_enable_silabs_cte_t;


PACKSTRUCT( struct sl_bt_cmd_connection_analyzer_start_s
{
    uint32_t access_address;
    uint32_t crc_init;
    uint16_t interval;
    uint16_t supervision_timeout;
    uint8_t central_clock_accuracy;
    uint8_t central_phy;
    uint8_t peripheral_phy;
    uint8_t channel_selection_algorithm;
    uint8_t hop;
    sl_bt_connection_channel_map_t channel_map;
    uint8_t channel;
    uint16_t event_counter;
    int32_t start_time_us;
    uint32_t flags;
});

typedef struct sl_bt_cmd_connection_analyzer_start_s sl_bt_cmd_connection_analyzer_start_t;


PACKSTRUCT( struct sl_bt_cmd_connection_analyzer_stop_s
{
    uint8_t analyzer;
});

typedef struct sl_bt_cmd_connection_analyzer_stop_s sl_bt_cmd_connection_analyzer_stop_t;


PACKSTRUCT( struct sl_bt_cmd_user_message_to_target_s
{
    uint8array data;
});

typedef struct sl_bt_cmd_user_message_to_target_s sl_bt_cmd_user_message_to_target_t;


PACKSTRUCT( struct sl_bt_cmd_user_manage_event_filter_s
{
    uint8array data;
});

typedef struct sl_bt_cmd_user_manage_event_filter_s sl_bt_cmd_user_manage_event_filter_t;


PACKSTRUCT( struct sl_bt_cmd_user_cs_service_message_to_target_s
{
    uint8array data;
});

typedef struct sl_bt_cmd_user_cs_service_message_to_target_s sl_bt_cmd_user_cs_service_message_to_target_t;




PACKSTRUCT( struct sl_bt_rsp_dfu_flash_set_address_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_dfu_flash_set_address_s sl_bt_rsp_dfu_flash_set_address_t;


PACKSTRUCT( struct sl_bt_rsp_dfu_flash_upload_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_dfu_flash_upload_s sl_bt_rsp_dfu_flash_upload_t;


PACKSTRUCT( struct sl_bt_rsp_dfu_flash_upload_finish_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_dfu_flash_upload_finish_s sl_bt_rsp_dfu_flash_upload_finish_t;


PACKSTRUCT( struct sl_bt_rsp_system_hello_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_system_hello_s sl_bt_rsp_system_hello_t;


PACKSTRUCT( struct sl_bt_rsp_system_start_bluetooth_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_system_start_bluetooth_s sl_bt_rsp_system_start_bluetooth_t;


PACKSTRUCT( struct sl_bt_rsp_system_stop_bluetooth_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_system_stop_bluetooth_s sl_bt_rsp_system_stop_bluetooth_t;


PACKSTRUCT( struct sl_bt_rsp_system_forcefully_stop_bluetooth_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_system_forcefully_stop_bluetooth_s sl_bt_rsp_system_forcefully_stop_bluetooth_t;


PACKSTRUCT( struct sl_bt_rsp_system_get_version_s
{
    uint16_t result;
    uint16_t major;
    uint16_t minor;
    uint16_t patch;
    uint16_t build;
    uint32_t bootloader;
    uint32_t hash;
});

typedef struct sl_bt_rsp_system_get_version_s sl_bt_rsp_system_get_version_t;


PACKSTRUCT( struct sl_bt_rsp_system_halt_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_system_halt_s sl_bt_rsp_system_halt_t;


