SiliconLabsSoftware/boltON/NXP/ncp_host_MCXA156/source/sli_bt_api.h
PACKSTRUCT( struct sl_bt_rsp_system_linklayer_configure_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_system_linklayer_configure_s sl_bt_rsp_system_linklayer_configure_t;


PACKSTRUCT( struct sl_bt_rsp_system_set_tx_power_s
{
    uint16_t result;
    int16_t set_min;
    int16_t set_max;
});

typedef struct sl_bt_rsp_system_set_tx_power_s sl_bt_rsp_system_set_tx_power_t;


PACKSTRUCT( struct sl_bt_rsp_system_get_tx_power_setting_s
{
    uint16_t result;
    int16_t support_min;
    int16_t support_max;
    int16_t set_min;
    int16_t set_max;
    int16_t rf_path_gain;
});

typedef struct sl_bt_rsp_system_get_tx_power_setting_s sl_bt_rsp_system_get_tx_power_setting_t;


PACKSTRUCT( struct sl_bt_rsp_system_set_identity_address_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_system_set_identity_address_s sl_bt_rsp_system_set_identity_address_t;


PACKSTRUCT( struct sl_bt_rsp_system_get_identity_address_s
{
    uint16_t result;
    bd_addr address;
    uint8_t type;
});

typedef struct sl_bt_rsp_system_get_identity_address_s sl_bt_rsp_system_get_identity_address_t;


PACKSTRUCT( struct sl_bt_rsp_system_get_random_data_s
{
    uint16_t result;
    uint8array data;
});

typedef struct sl_bt_rsp_system_get_random_data_s sl_bt_rsp_system_get_random_data_t;


PACKSTRUCT( struct sl_bt_rsp_system_data_buffer_write_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_system_data_buffer_write_s sl_bt_rsp_system_data_buffer_write_t;


PACKSTRUCT( struct sl_bt_rsp_system_data_buffer_clear_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_system_data_buffer_clear_s sl_bt_rsp_system_data_buffer_clear_t;


PACKSTRUCT( struct sl_bt_rsp_system_get_counters_s
{
    uint16_t result;
    uint16_t tx_packets;
    uint16_t rx_packets;
    uint16_t crc_errors;
    uint16_t failures;
});

typedef struct sl_bt_rsp_system_get_counters_s sl_bt_rsp_system_get_counters_t;


PACKSTRUCT( struct sl_bt_rsp_system_set_lazy_soft_timer_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_system_set_lazy_soft_timer_s sl_bt_rsp_system_set_lazy_soft_timer_t;


PACKSTRUCT( struct sl_bt_rsp_resource_get_status_s
{
    uint16_t result;
    uint32_t total_bytes;
    uint32_t free_bytes;
});

typedef struct sl_bt_rsp_resource_get_status_s sl_bt_rsp_resource_get_status_t;


PACKSTRUCT( struct sl_bt_rsp_resource_set_report_threshold_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_resource_set_report_threshold_s sl_bt_rsp_resource_set_report_threshold_t;


PACKSTRUCT( struct sl_bt_rsp_resource_enable_connection_tx_report_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_resource_enable_connection_tx_report_s sl_bt_rsp_resource_enable_connection_tx_report_t;


PACKSTRUCT( struct sl_bt_rsp_resource_get_connection_tx_status_s
{
    uint16_t result;
    uint16_t flags;
    uint16_t packet_count;
    uint32_t data_len;
});

typedef struct sl_bt_rsp_resource_get_connection_tx_status_s sl_bt_rsp_resource_get_connection_tx_status_t;


PACKSTRUCT( struct sl_bt_rsp_resource_disable_connection_tx_report_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_resource_disable_connection_tx_report_s sl_bt_rsp_resource_disable_connection_tx_report_t;


PACKSTRUCT( struct sl_bt_rsp_gap_set_privacy_mode_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_gap_set_privacy_mode_s sl_bt_rsp_gap_set_privacy_mode_t;


PACKSTRUCT( struct sl_bt_rsp_gap_set_data_channel_classification_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_gap_set_data_channel_classification_s sl_bt_rsp_gap_set_data_channel_classification_t;


PACKSTRUCT( struct sl_bt_rsp_gap_set_identity_address_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_gap_set_identity_address_s sl_bt_rsp_gap_set_identity_address_t;


PACKSTRUCT( struct sl_bt_rsp_gap_get_identity_address_s
{
    uint16_t result;
    bd_addr address;
    uint8_t type;
});

typedef struct sl_bt_rsp_gap_get_identity_address_s sl_bt_rsp_gap_get_identity_address_t;


PACKSTRUCT( struct sl_bt_rsp_advertiser_create_set_s
{
    uint16_t result;
    uint8_t handle;
});

typedef struct sl_bt_rsp_advertiser_create_set_s sl_bt_rsp_advertiser_create_set_t;


PACKSTRUCT( struct sl_bt_rsp_advertiser_configure_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_advertiser_configure_s sl_bt_rsp_advertiser_configure_t;


PACKSTRUCT( struct sl_bt_rsp_advertiser_set_timing_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_advertiser_set_timing_s sl_bt_rsp_advertiser_set_timing_t;


PACKSTRUCT( struct sl_bt_rsp_advertiser_set_channel_map_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_advertiser_set_channel_map_s sl_bt_rsp_advertiser_set_channel_map_t;


PACKSTRUCT( struct sl_bt_rsp_advertiser_set_tx_power_s
{
    uint16_t result;
    int16_t set_power;
});

typedef struct sl_bt_rsp_advertiser_set_tx_power_s sl_bt_rsp_advertiser_set_tx_power_t;


PACKSTRUCT( struct sl_bt_rsp_advertiser_set_report_scan_request_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_advertiser_set_report_scan_request_s sl_bt_rsp_advertiser_set_report_scan_request_t;


PACKSTRUCT( struct sl_bt_rsp_advertiser_set_random_address_s
{
    uint16_t result;
    bd_addr address_out;
});

typedef struct sl_bt_rsp_advertiser_set_random_address_s sl_bt_rsp_advertiser_set_random_address_t;


PACKSTRUCT( struct sl_bt_rsp_advertiser_clear_random_address_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_advertiser_clear_random_address_s sl_bt_rsp_advertiser_clear_random_address_t;


PACKSTRUCT( struct sl_bt_rsp_advertiser_stop_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_advertiser_stop_s sl_bt_rsp_advertiser_stop_t;


PACKSTRUCT( struct sl_bt_rsp_advertiser_delete_set_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_advertiser_delete_set_s sl_bt_rsp_advertiser_delete_set_t;


PACKSTRUCT( struct sl_bt_rsp_legacy_advertiser_set_data_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_legacy_advertiser_set_data_s sl_bt_rsp_legacy_advertiser_set_data_t;


PACKSTRUCT( struct sl_bt_rsp_legacy_advertiser_generate_data_s
{
    uint16_t result;
});

