SiliconLabsSoftware/boltON/NXP/ncp_host_MCXA156/source/sli_bt_api.h
typedef struct sl_bt_rsp_legacy_advertiser_generate_data_s sl_bt_rsp_legacy_advertiser_generate_data_t;


PACKSTRUCT( struct sl_bt_rsp_legacy_advertiser_start_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_legacy_advertiser_start_s sl_bt_rsp_legacy_advertiser_start_t;


PACKSTRUCT( struct sl_bt_rsp_legacy_advertiser_start_directed_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_legacy_advertiser_start_directed_s sl_bt_rsp_legacy_advertiser_start_directed_t;


PACKSTRUCT( struct sl_bt_rsp_extended_advertiser_set_phy_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_extended_advertiser_set_phy_s sl_bt_rsp_extended_advertiser_set_phy_t;


PACKSTRUCT( struct sl_bt_rsp_extended_advertiser_set_data_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_extended_advertiser_set_data_s sl_bt_rsp_extended_advertiser_set_data_t;


PACKSTRUCT( struct sl_bt_rsp_extended_advertiser_set_long_data_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_extended_advertiser_set_long_data_s sl_bt_rsp_extended_advertiser_set_long_data_t;


PACKSTRUCT( struct sl_bt_rsp_extended_advertiser_generate_data_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_extended_advertiser_generate_data_s sl_bt_rsp_extended_advertiser_generate_data_t;


PACKSTRUCT( struct sl_bt_rsp_extended_advertiser_start_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_extended_advertiser_start_s sl_bt_rsp_extended_advertiser_start_t;


PACKSTRUCT( struct sl_bt_rsp_extended_advertiser_start_directed_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_extended_advertiser_start_directed_s sl_bt_rsp_extended_advertiser_start_directed_t;


PACKSTRUCT( struct sl_bt_rsp_periodic_advertiser_set_data_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_periodic_advertiser_set_data_s sl_bt_rsp_periodic_advertiser_set_data_t;


PACKSTRUCT( struct sl_bt_rsp_periodic_advertiser_set_long_data_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_periodic_advertiser_set_long_data_s sl_bt_rsp_periodic_advertiser_set_long_data_t;


PACKSTRUCT( struct sl_bt_rsp_periodic_advertiser_start_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_periodic_advertiser_start_s sl_bt_rsp_periodic_advertiser_start_t;


PACKSTRUCT( struct sl_bt_rsp_periodic_advertiser_stop_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_periodic_advertiser_stop_s sl_bt_rsp_periodic_advertiser_stop_t;


PACKSTRUCT( struct sl_bt_rsp_scanner_set_parameters_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_scanner_set_parameters_s sl_bt_rsp_scanner_set_parameters_t;


PACKSTRUCT( struct sl_bt_rsp_scanner_set_parameters_and_filter_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_scanner_set_parameters_and_filter_s sl_bt_rsp_scanner_set_parameters_and_filter_t;


PACKSTRUCT( struct sl_bt_rsp_scanner_start_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_scanner_start_s sl_bt_rsp_scanner_start_t;


PACKSTRUCT( struct sl_bt_rsp_scanner_stop_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_scanner_stop_s sl_bt_rsp_scanner_stop_t;


PACKSTRUCT( struct sl_bt_rsp_sync_set_reporting_mode_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_sync_set_reporting_mode_s sl_bt_rsp_sync_set_reporting_mode_t;


PACKSTRUCT( struct sl_bt_rsp_sync_update_sync_parameters_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_sync_update_sync_parameters_s sl_bt_rsp_sync_update_sync_parameters_t;


PACKSTRUCT( struct sl_bt_rsp_sync_close_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_sync_close_s sl_bt_rsp_sync_close_t;


PACKSTRUCT( struct sl_bt_rsp_sync_scanner_set_sync_parameters_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_sync_scanner_set_sync_parameters_s sl_bt_rsp_sync_scanner_set_sync_parameters_t;


PACKSTRUCT( struct sl_bt_rsp_sync_scanner_open_s
{
    uint16_t result;
    uint16_t sync;
});

typedef struct sl_bt_rsp_sync_scanner_open_s sl_bt_rsp_sync_scanner_open_t;


PACKSTRUCT( struct sl_bt_rsp_past_receiver_set_default_sync_receive_parameters_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_past_receiver_set_default_sync_receive_parameters_s sl_bt_rsp_past_receiver_set_default_sync_receive_parameters_t;


PACKSTRUCT( struct sl_bt_rsp_past_receiver_set_sync_receive_parameters_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_past_receiver_set_sync_receive_parameters_s sl_bt_rsp_past_receiver_set_sync_receive_parameters_t;


PACKSTRUCT( struct sl_bt_rsp_advertiser_past_transfer_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_advertiser_past_transfer_s sl_bt_rsp_advertiser_past_transfer_t;


PACKSTRUCT( struct sl_bt_rsp_sync_past_transfer_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_sync_past_transfer_s sl_bt_rsp_sync_past_transfer_t;


PACKSTRUCT( struct sl_bt_rsp_pawr_sync_set_sync_subevents_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_pawr_sync_set_sync_subevents_s sl_bt_rsp_pawr_sync_set_sync_subevents_t;


PACKSTRUCT( struct sl_bt_rsp_pawr_sync_set_response_data_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_pawr_sync_set_response_data_s sl_bt_rsp_pawr_sync_set_response_data_t;


PACKSTRUCT( struct sl_bt_rsp_pawr_advertiser_start_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_pawr_advertiser_start_s sl_bt_rsp_pawr_advertiser_start_t;


PACKSTRUCT( struct sl_bt_rsp_pawr_advertiser_set_subevent_data_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_pawr_advertiser_set_subevent_data_s sl_bt_rsp_pawr_advertiser_set_subevent_data_t;


PACKSTRUCT( struct sl_bt_rsp_pawr_advertiser_create_connection_s
{
    uint16_t result;
    uint8_t connection;
});

typedef struct sl_bt_rsp_pawr_advertiser_create_connection_s sl_bt_rsp_pawr_advertiser_create_connection_t;


PACKSTRUCT( struct sl_bt_rsp_pawr_advertiser_stop_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_pawr_advertiser_stop_s sl_bt_rsp_pawr_advertiser_stop_t;


PACKSTRUCT( struct sl_bt_rsp_connection_set_default_parameters_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_connection_set_default_parameters_s sl_bt_rsp_connection_set_default_parameters_t;


PACKSTRUCT( struct sl_bt_rsp_connection_set_default_preferred_phy_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_connection_set_default_preferred_phy_s sl_bt_rsp_connection_set_default_preferred_phy_t;


PACKSTRUCT( struct sl_bt_rsp_connection_set_default_data_length_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_connection_set_default_data_length_s sl_bt_rsp_connection_set_default_data_length_t;


