SiliconLabsSoftware/boltON/NXP/ncp_host_MCXA156/source/sli_bt_api.h
PACKSTRUCT( struct sl_bt_rsp_connection_set_default_acceptable_subrate_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_connection_set_default_acceptable_subrate_s sl_bt_rsp_connection_set_default_acceptable_subrate_t;


PACKSTRUCT( struct sl_bt_rsp_connection_open_s
{
    uint16_t result;
    uint8_t connection;
});

typedef struct sl_bt_rsp_connection_open_s sl_bt_rsp_connection_open_t;


PACKSTRUCT( struct sl_bt_rsp_connection_open_with_accept_list_s
{
    uint16_t result;
    uint8_t connection;
});

typedef struct sl_bt_rsp_connection_open_with_accept_list_s sl_bt_rsp_connection_open_with_accept_list_t;


PACKSTRUCT( struct sl_bt_rsp_connection_set_parameters_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_connection_set_parameters_s sl_bt_rsp_connection_set_parameters_t;


PACKSTRUCT( struct sl_bt_rsp_connection_set_preferred_phy_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_connection_set_preferred_phy_s sl_bt_rsp_connection_set_preferred_phy_t;


PACKSTRUCT( struct sl_bt_rsp_connection_disable_slave_latency_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_connection_disable_slave_latency_s sl_bt_rsp_connection_disable_slave_latency_t;


PACKSTRUCT( struct sl_bt_rsp_connection_get_median_rssi_s
{
    uint16_t result;
    int8_t rssi;
});

typedef struct sl_bt_rsp_connection_get_median_rssi_s sl_bt_rsp_connection_get_median_rssi_t;


PACKSTRUCT( struct sl_bt_rsp_connection_read_channel_map_s
{
    uint16_t result;
    uint8array channel_map;
});

typedef struct sl_bt_rsp_connection_read_channel_map_s sl_bt_rsp_connection_read_channel_map_t;


PACKSTRUCT( struct sl_bt_rsp_connection_set_power_reporting_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_connection_set_power_reporting_s sl_bt_rsp_connection_set_power_reporting_t;


PACKSTRUCT( struct sl_bt_rsp_connection_set_remote_power_reporting_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_connection_set_remote_power_reporting_s sl_bt_rsp_connection_set_remote_power_reporting_t;


PACKSTRUCT( struct sl_bt_rsp_connection_get_tx_power_s
{
    uint16_t result;
    int8_t current_level;
    int8_t max_level;
});

typedef struct sl_bt_rsp_connection_get_tx_power_s sl_bt_rsp_connection_get_tx_power_t;


PACKSTRUCT( struct sl_bt_rsp_connection_get_remote_tx_power_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_connection_get_remote_tx_power_s sl_bt_rsp_connection_get_remote_tx_power_t;


PACKSTRUCT( struct sl_bt_rsp_connection_set_tx_power_s
{
    uint16_t result;
    int16_t tx_power_out;
});

typedef struct sl_bt_rsp_connection_set_tx_power_s sl_bt_rsp_connection_set_tx_power_t;


PACKSTRUCT( struct sl_bt_rsp_connection_read_remote_used_features_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_connection_read_remote_used_features_s sl_bt_rsp_connection_read_remote_used_features_t;


PACKSTRUCT( struct sl_bt_rsp_connection_get_security_status_s
{
    uint16_t result;
    uint8_t security_mode;
    uint8_t key_size;
    uint8_t bonding_handle;
});

typedef struct sl_bt_rsp_connection_get_security_status_s sl_bt_rsp_connection_get_security_status_t;


PACKSTRUCT( struct sl_bt_rsp_connection_set_data_length_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_connection_set_data_length_s sl_bt_rsp_connection_set_data_length_t;


PACKSTRUCT( struct sl_bt_rsp_connection_read_statistics_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_connection_read_statistics_s sl_bt_rsp_connection_read_statistics_t;


PACKSTRUCT( struct sl_bt_rsp_connection_get_scheduling_details_s
{
    uint16_t result;
    uint32_t access_address;
    uint8_t role;
    uint32_t crc_init;
    uint16_t interval;
    uint16_t supervision_timeout;
    uint8_t central_clock_accuracy;
    uint8_t central_phy;
    uint8_t peripheral_phy;
    uint8_t channel_selection_algorithm;
    uint8_t hop;
    sl_bt_connection_channel_map_t channel_map;
    uint8_t channel;
    uint16_t event_counter;
    uint32_t start_time_us;
});

typedef struct sl_bt_rsp_connection_get_scheduling_details_s sl_bt_rsp_connection_get_scheduling_details_t;


PACKSTRUCT( struct sl_bt_rsp_connection_get_remote_address_s
{
    uint16_t result;
    bd_addr address;
    uint8_t address_type;
});

typedef struct sl_bt_rsp_connection_get_remote_address_s sl_bt_rsp_connection_get_remote_address_t;


PACKSTRUCT( struct sl_bt_rsp_connection_request_subrate_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_connection_request_subrate_s sl_bt_rsp_connection_request_subrate_t;


PACKSTRUCT( struct sl_bt_rsp_connection_get_state_s
{
    uint16_t result;
    uint8_t state;
});

typedef struct sl_bt_rsp_connection_get_state_s sl_bt_rsp_connection_get_state_t;


PACKSTRUCT( struct sl_bt_rsp_connection_close_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_connection_close_s sl_bt_rsp_connection_close_t;


PACKSTRUCT( struct sl_bt_rsp_connection_forcefully_close_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_connection_forcefully_close_s sl_bt_rsp_connection_forcefully_close_t;


PACKSTRUCT( struct sl_bt_rsp_gatt_set_max_mtu_s
{
    uint16_t result;
    uint16_t max_mtu_out;
});

typedef struct sl_bt_rsp_gatt_set_max_mtu_s sl_bt_rsp_gatt_set_max_mtu_t;


PACKSTRUCT( struct sl_bt_rsp_gatt_discover_primary_services_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_gatt_discover_primary_services_s sl_bt_rsp_gatt_discover_primary_services_t;


PACKSTRUCT( struct sl_bt_rsp_gatt_discover_primary_services_by_uuid_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_gatt_discover_primary_services_by_uuid_s sl_bt_rsp_gatt_discover_primary_services_by_uuid_t;


PACKSTRUCT( struct sl_bt_rsp_gatt_find_included_services_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_gatt_find_included_services_s sl_bt_rsp_gatt_find_included_services_t;


PACKSTRUCT( struct sl_bt_rsp_gatt_discover_characteristics_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_gatt_discover_characteristics_s sl_bt_rsp_gatt_discover_characteristics_t;


PACKSTRUCT( struct sl_bt_rsp_gatt_discover_characteristics_by_uuid_s
{
    uint16_t result;
});

