SiliconLabsSoftware/boltON/NXP/ncp_host_MCXA156/source/sli_bt_api.h
typedef struct sl_bt_rsp_gatt_discover_characteristics_by_uuid_s sl_bt_rsp_gatt_discover_characteristics_by_uuid_t;


PACKSTRUCT( struct sl_bt_rsp_gatt_discover_descriptors_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_gatt_discover_descriptors_s sl_bt_rsp_gatt_discover_descriptors_t;


PACKSTRUCT( struct sl_bt_rsp_gatt_discover_characteristic_descriptors_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_gatt_discover_characteristic_descriptors_s sl_bt_rsp_gatt_discover_characteristic_descriptors_t;


PACKSTRUCT( struct sl_bt_rsp_gatt_set_characteristic_notification_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_gatt_set_characteristic_notification_s sl_bt_rsp_gatt_set_characteristic_notification_t;


PACKSTRUCT( struct sl_bt_rsp_gatt_send_characteristic_confirmation_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_gatt_send_characteristic_confirmation_s sl_bt_rsp_gatt_send_characteristic_confirmation_t;


PACKSTRUCT( struct sl_bt_rsp_gatt_read_characteristic_value_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_gatt_read_characteristic_value_s sl_bt_rsp_gatt_read_characteristic_value_t;


PACKSTRUCT( struct sl_bt_rsp_gatt_read_characteristic_value_from_offset_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_gatt_read_characteristic_value_from_offset_s sl_bt_rsp_gatt_read_characteristic_value_from_offset_t;


PACKSTRUCT( struct sl_bt_rsp_gatt_read_multiple_characteristic_values_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_gatt_read_multiple_characteristic_values_s sl_bt_rsp_gatt_read_multiple_characteristic_values_t;


PACKSTRUCT( struct sl_bt_rsp_gatt_read_variable_length_characteristic_values_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_gatt_read_variable_length_characteristic_values_s sl_bt_rsp_gatt_read_variable_length_characteristic_values_t;


PACKSTRUCT( struct sl_bt_rsp_gatt_read_characteristic_value_by_uuid_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_gatt_read_characteristic_value_by_uuid_s sl_bt_rsp_gatt_read_characteristic_value_by_uuid_t;


PACKSTRUCT( struct sl_bt_rsp_gatt_write_characteristic_value_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_gatt_write_characteristic_value_s sl_bt_rsp_gatt_write_characteristic_value_t;


PACKSTRUCT( struct sl_bt_rsp_gatt_write_characteristic_value_without_response_s
{
    uint16_t result;
    uint16_t sent_len;
});

typedef struct sl_bt_rsp_gatt_write_characteristic_value_without_response_s sl_bt_rsp_gatt_write_characteristic_value_without_response_t;


PACKSTRUCT( struct sl_bt_rsp_gatt_prepare_characteristic_value_write_s
{
    uint16_t result;
    uint16_t sent_len;
});

typedef struct sl_bt_rsp_gatt_prepare_characteristic_value_write_s sl_bt_rsp_gatt_prepare_characteristic_value_write_t;


PACKSTRUCT( struct sl_bt_rsp_gatt_prepare_characteristic_value_reliable_write_s
{
    uint16_t result;
    uint16_t sent_len;
});

typedef struct sl_bt_rsp_gatt_prepare_characteristic_value_reliable_write_s sl_bt_rsp_gatt_prepare_characteristic_value_reliable_write_t;


PACKSTRUCT( struct sl_bt_rsp_gatt_execute_characteristic_value_write_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_gatt_execute_characteristic_value_write_s sl_bt_rsp_gatt_execute_characteristic_value_write_t;


PACKSTRUCT( struct sl_bt_rsp_gatt_read_descriptor_value_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_gatt_read_descriptor_value_s sl_bt_rsp_gatt_read_descriptor_value_t;


PACKSTRUCT( struct sl_bt_rsp_gatt_write_descriptor_value_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_gatt_write_descriptor_value_s sl_bt_rsp_gatt_write_descriptor_value_t;


PACKSTRUCT( struct sl_bt_rsp_gatt_get_mtu_s
{
    uint16_t result;
    uint16_t mtu;
});

typedef struct sl_bt_rsp_gatt_get_mtu_s sl_bt_rsp_gatt_get_mtu_t;


PACKSTRUCT( struct sl_bt_rsp_gattdb_new_session_s
{
    uint16_t result;
    uint16_t session;
});

typedef struct sl_bt_rsp_gattdb_new_session_s sl_bt_rsp_gattdb_new_session_t;


PACKSTRUCT( struct sl_bt_rsp_gattdb_add_service_s
{
    uint16_t result;
    uint16_t service;
});

typedef struct sl_bt_rsp_gattdb_add_service_s sl_bt_rsp_gattdb_add_service_t;


PACKSTRUCT( struct sl_bt_rsp_gattdb_remove_service_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_gattdb_remove_service_s sl_bt_rsp_gattdb_remove_service_t;


PACKSTRUCT( struct sl_bt_rsp_gattdb_add_included_service_s
{
    uint16_t result;
    uint16_t attribute;
});

typedef struct sl_bt_rsp_gattdb_add_included_service_s sl_bt_rsp_gattdb_add_included_service_t;


PACKSTRUCT( struct sl_bt_rsp_gattdb_remove_included_service_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_gattdb_remove_included_service_s sl_bt_rsp_gattdb_remove_included_service_t;


PACKSTRUCT( struct sl_bt_rsp_gattdb_add_uuid16_characteristic_s
{
    uint16_t result;
    uint16_t characteristic;
});

typedef struct sl_bt_rsp_gattdb_add_uuid16_characteristic_s sl_bt_rsp_gattdb_add_uuid16_characteristic_t;


PACKSTRUCT( struct sl_bt_rsp_gattdb_add_uuid128_characteristic_s
{
    uint16_t result;
    uint16_t characteristic;
});

typedef struct sl_bt_rsp_gattdb_add_uuid128_characteristic_s sl_bt_rsp_gattdb_add_uuid128_characteristic_t;


PACKSTRUCT( struct sl_bt_rsp_gattdb_remove_characteristic_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_gattdb_remove_characteristic_s sl_bt_rsp_gattdb_remove_characteristic_t;


PACKSTRUCT( struct sl_bt_rsp_gattdb_add_uuid16_descriptor_s
{
    uint16_t result;
    uint16_t descriptor;
});

typedef struct sl_bt_rsp_gattdb_add_uuid16_descriptor_s sl_bt_rsp_gattdb_add_uuid16_descriptor_t;


PACKSTRUCT( struct sl_bt_rsp_gattdb_add_uuid128_descriptor_s
{
    uint16_t result;
    uint16_t descriptor;
});

typedef struct sl_bt_rsp_gattdb_add_uuid128_descriptor_s sl_bt_rsp_gattdb_add_uuid128_descriptor_t;


PACKSTRUCT( struct sl_bt_rsp_gattdb_remove_descriptor_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_gattdb_remove_descriptor_s sl_bt_rsp_gattdb_remove_descriptor_t;


PACKSTRUCT( struct sl_bt_rsp_gattdb_start_service_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_gattdb_start_service_s sl_bt_rsp_gattdb_start_service_t;


PACKSTRUCT( struct sl_bt_rsp_gattdb_stop_service_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_gattdb_stop_service_s sl_bt_rsp_gattdb_stop_service_t;


