SiliconLabsSoftware/boltON/NXP/ncp_host_MCXA156/source/sli_bt_api.h
PACKSTRUCT( struct sl_bt_rsp_gattdb_start_characteristic_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_gattdb_start_characteristic_s sl_bt_rsp_gattdb_start_characteristic_t;


PACKSTRUCT( struct sl_bt_rsp_gattdb_stop_characteristic_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_gattdb_stop_characteristic_s sl_bt_rsp_gattdb_stop_characteristic_t;


PACKSTRUCT( struct sl_bt_rsp_gattdb_commit_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_gattdb_commit_s sl_bt_rsp_gattdb_commit_t;


PACKSTRUCT( struct sl_bt_rsp_gattdb_abort_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_gattdb_abort_s sl_bt_rsp_gattdb_abort_t;


PACKSTRUCT( struct sl_bt_rsp_gattdb_get_attribute_state_s
{
    uint16_t result;
    uint8_t state;
});

typedef struct sl_bt_rsp_gattdb_get_attribute_state_s sl_bt_rsp_gattdb_get_attribute_state_t;


PACKSTRUCT( struct sl_bt_rsp_gatt_server_set_max_mtu_s
{
    uint16_t result;
    uint16_t max_mtu_out;
});

typedef struct sl_bt_rsp_gatt_server_set_max_mtu_s sl_bt_rsp_gatt_server_set_max_mtu_t;


PACKSTRUCT( struct sl_bt_rsp_gatt_server_get_mtu_s
{
    uint16_t result;
    uint16_t mtu;
});

typedef struct sl_bt_rsp_gatt_server_get_mtu_s sl_bt_rsp_gatt_server_get_mtu_t;


PACKSTRUCT( struct sl_bt_rsp_gatt_server_find_attribute_s
{
    uint16_t result;
    uint16_t attribute;
});

typedef struct sl_bt_rsp_gatt_server_find_attribute_s sl_bt_rsp_gatt_server_find_attribute_t;


PACKSTRUCT( struct sl_bt_rsp_gatt_server_find_primary_service_s
{
    uint16_t result;
    uint16_t start_out;
    uint16_t end_out;
});

typedef struct sl_bt_rsp_gatt_server_find_primary_service_s sl_bt_rsp_gatt_server_find_primary_service_t;


PACKSTRUCT( struct sl_bt_rsp_gatt_server_read_attribute_value_s
{
    uint16_t result;
    uint8array value;
});

typedef struct sl_bt_rsp_gatt_server_read_attribute_value_s sl_bt_rsp_gatt_server_read_attribute_value_t;


PACKSTRUCT( struct sl_bt_rsp_gatt_server_read_attribute_type_s
{
    uint16_t result;
    uint8array type;
});

typedef struct sl_bt_rsp_gatt_server_read_attribute_type_s sl_bt_rsp_gatt_server_read_attribute_type_t;


PACKSTRUCT( struct sl_bt_rsp_gatt_server_read_attribute_properties_s
{
    uint16_t result;
    uint8_t category;
    uint16_t security;
    uint16_t properties;
    uint8_t value_type;
    uint16_t len;
    uint16_t max_writable_len;
});

typedef struct sl_bt_rsp_gatt_server_read_attribute_properties_s sl_bt_rsp_gatt_server_read_attribute_properties_t;


PACKSTRUCT( struct sl_bt_rsp_gatt_server_write_attribute_value_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_gatt_server_write_attribute_value_s sl_bt_rsp_gatt_server_write_attribute_value_t;


PACKSTRUCT( struct sl_bt_rsp_gatt_server_send_user_read_response_s
{
    uint16_t result;
    uint16_t sent_len;
});

typedef struct sl_bt_rsp_gatt_server_send_user_read_response_s sl_bt_rsp_gatt_server_send_user_read_response_t;


PACKSTRUCT( struct sl_bt_rsp_gatt_server_send_user_write_response_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_gatt_server_send_user_write_response_s sl_bt_rsp_gatt_server_send_user_write_response_t;


PACKSTRUCT( struct sl_bt_rsp_gatt_server_send_notification_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_gatt_server_send_notification_s sl_bt_rsp_gatt_server_send_notification_t;


PACKSTRUCT( struct sl_bt_rsp_gatt_server_send_indication_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_gatt_server_send_indication_s sl_bt_rsp_gatt_server_send_indication_t;


PACKSTRUCT( struct sl_bt_rsp_gatt_server_notify_all_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_gatt_server_notify_all_s sl_bt_rsp_gatt_server_notify_all_t;


PACKSTRUCT( struct sl_bt_rsp_gatt_server_read_client_configuration_s
{
    uint16_t result;
    uint16_t client_config_flags;
});

typedef struct sl_bt_rsp_gatt_server_read_client_configuration_s sl_bt_rsp_gatt_server_read_client_configuration_t;


PACKSTRUCT( struct sl_bt_rsp_gatt_server_send_user_prepare_write_response_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_gatt_server_send_user_prepare_write_response_s sl_bt_rsp_gatt_server_send_user_prepare_write_response_t;


PACKSTRUCT( struct sl_bt_rsp_gatt_server_set_capabilities_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_gatt_server_set_capabilities_s sl_bt_rsp_gatt_server_set_capabilities_t;


PACKSTRUCT( struct sl_bt_rsp_gatt_server_enable_capabilities_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_gatt_server_enable_capabilities_s sl_bt_rsp_gatt_server_enable_capabilities_t;


PACKSTRUCT( struct sl_bt_rsp_gatt_server_disable_capabilities_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_gatt_server_disable_capabilities_s sl_bt_rsp_gatt_server_disable_capabilities_t;


PACKSTRUCT( struct sl_bt_rsp_gatt_server_get_enabled_capabilities_s
{
    uint16_t result;
    uint32_t caps;
});

typedef struct sl_bt_rsp_gatt_server_get_enabled_capabilities_s sl_bt_rsp_gatt_server_get_enabled_capabilities_t;


PACKSTRUCT( struct sl_bt_rsp_gatt_server_read_client_supported_features_s
{
    uint16_t result;
    uint8_t client_features;
});

typedef struct sl_bt_rsp_gatt_server_read_client_supported_features_s sl_bt_rsp_gatt_server_read_client_supported_features_t;


PACKSTRUCT( struct sl_bt_rsp_nvm_save_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_nvm_save_s sl_bt_rsp_nvm_save_t;


PACKSTRUCT( struct sl_bt_rsp_nvm_load_s
{
    uint16_t result;
    uint8array value;
});

typedef struct sl_bt_rsp_nvm_load_s sl_bt_rsp_nvm_load_t;


PACKSTRUCT( struct sl_bt_rsp_nvm_erase_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_nvm_erase_s sl_bt_rsp_nvm_erase_t;


PACKSTRUCT( struct sl_bt_rsp_nvm_erase_all_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_nvm_erase_all_s sl_bt_rsp_nvm_erase_all_t;


PACKSTRUCT( struct sl_bt_rsp_test_dtm_tx_v4_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_test_dtm_tx_v4_s sl_bt_rsp_test_dtm_tx_v4_t;


PACKSTRUCT( struct sl_bt_rsp_test_dtm_tx_cw_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_test_dtm_tx_cw_s sl_bt_rsp_test_dtm_tx_cw_t;


PACKSTRUCT( struct sl_bt_rsp_test_dtm_rx_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_test_dtm_rx_s sl_bt_rsp_test_dtm_rx_t;


PACKSTRUCT( struct sl_bt_rsp_test_dtm_end_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_test_dtm_end_s sl_bt_rsp_test_dtm_end_t;


