SiliconLabsSoftware/boltON/NXP/ncp_host_MCXA156/source/sli_bt_api.h
PACKSTRUCT( struct sl_bt_rsp_sm_configure_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_sm_configure_s sl_bt_rsp_sm_configure_t;


PACKSTRUCT( struct sl_bt_rsp_sm_set_minimum_key_size_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_sm_set_minimum_key_size_s sl_bt_rsp_sm_set_minimum_key_size_t;


PACKSTRUCT( struct sl_bt_rsp_sm_set_debug_mode_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_sm_set_debug_mode_s sl_bt_rsp_sm_set_debug_mode_t;


PACKSTRUCT( struct sl_bt_rsp_sm_store_bonding_configuration_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_sm_store_bonding_configuration_s sl_bt_rsp_sm_store_bonding_configuration_t;


PACKSTRUCT( struct sl_bt_rsp_sm_set_bondable_mode_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_sm_set_bondable_mode_s sl_bt_rsp_sm_set_bondable_mode_t;


PACKSTRUCT( struct sl_bt_rsp_sm_set_passkey_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_sm_set_passkey_s sl_bt_rsp_sm_set_passkey_t;


PACKSTRUCT( struct sl_bt_rsp_sm_increase_security_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_sm_increase_security_s sl_bt_rsp_sm_increase_security_t;


PACKSTRUCT( struct sl_bt_rsp_sm_enter_passkey_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_sm_enter_passkey_s sl_bt_rsp_sm_enter_passkey_t;


PACKSTRUCT( struct sl_bt_rsp_sm_passkey_confirm_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_sm_passkey_confirm_s sl_bt_rsp_sm_passkey_confirm_t;


PACKSTRUCT( struct sl_bt_rsp_sm_bonding_confirm_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_sm_bonding_confirm_s sl_bt_rsp_sm_bonding_confirm_t;


PACKSTRUCT( struct sl_bt_rsp_sm_delete_bonding_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_sm_delete_bonding_s sl_bt_rsp_sm_delete_bonding_t;


PACKSTRUCT( struct sl_bt_rsp_sm_delete_bondings_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_sm_delete_bondings_s sl_bt_rsp_sm_delete_bondings_t;


PACKSTRUCT( struct sl_bt_rsp_sm_get_bonding_handles_s
{
    uint16_t result;
    uint32_t num_bondings;
    uint8array bondings;
});

typedef struct sl_bt_rsp_sm_get_bonding_handles_s sl_bt_rsp_sm_get_bonding_handles_t;


PACKSTRUCT( struct sl_bt_rsp_sm_get_bonding_details_s
{
    uint16_t result;
    bd_addr address;
    uint8_t address_type;
    uint8_t security_mode;
    uint8_t key_size;
});

typedef struct sl_bt_rsp_sm_get_bonding_details_s sl_bt_rsp_sm_get_bonding_details_t;


PACKSTRUCT( struct sl_bt_rsp_sm_find_bonding_by_address_s
{
    uint16_t result;
    uint32_t bonding;
    uint8_t security_mode;
    uint8_t key_size;
});

typedef struct sl_bt_rsp_sm_find_bonding_by_address_s sl_bt_rsp_sm_find_bonding_by_address_t;


PACKSTRUCT( struct sl_bt_rsp_sm_resolve_rpa_s
{
    uint16_t result;
    bd_addr address;
    uint8_t address_type;
    uint32_t bonding;
});

typedef struct sl_bt_rsp_sm_resolve_rpa_s sl_bt_rsp_sm_resolve_rpa_t;


PACKSTRUCT( struct sl_bt_rsp_sm_set_bonding_key_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_sm_set_bonding_key_s sl_bt_rsp_sm_set_bonding_key_t;


PACKSTRUCT( struct sl_bt_rsp_sm_set_legacy_oob_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_sm_set_legacy_oob_s sl_bt_rsp_sm_set_legacy_oob_t;


PACKSTRUCT( struct sl_bt_rsp_sm_set_oob_s
{
    uint16_t result;
    aes_key_128 random;
    aes_key_128 confirm;
});

typedef struct sl_bt_rsp_sm_set_oob_s sl_bt_rsp_sm_set_oob_t;


PACKSTRUCT( struct sl_bt_rsp_sm_set_remote_oob_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_sm_set_remote_oob_s sl_bt_rsp_sm_set_remote_oob_t;


PACKSTRUCT( struct sl_bt_rsp_external_bondingdb_set_data_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_external_bondingdb_set_data_s sl_bt_rsp_external_bondingdb_set_data_t;


PACKSTRUCT( struct sl_bt_rsp_resolving_list_add_device_by_bonding_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_resolving_list_add_device_by_bonding_s sl_bt_rsp_resolving_list_add_device_by_bonding_t;


PACKSTRUCT( struct sl_bt_rsp_resolving_list_add_device_by_address_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_resolving_list_add_device_by_address_s sl_bt_rsp_resolving_list_add_device_by_address_t;


PACKSTRUCT( struct sl_bt_rsp_resolving_list_remove_device_by_bonding_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_resolving_list_remove_device_by_bonding_s sl_bt_rsp_resolving_list_remove_device_by_bonding_t;


PACKSTRUCT( struct sl_bt_rsp_resolving_list_remove_device_by_address_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_resolving_list_remove_device_by_address_s sl_bt_rsp_resolving_list_remove_device_by_address_t;


PACKSTRUCT( struct sl_bt_rsp_resolving_list_remove_all_devices_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_resolving_list_remove_all_devices_s sl_bt_rsp_resolving_list_remove_all_devices_t;


PACKSTRUCT( struct sl_bt_rsp_accept_list_add_device_by_bonding_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_accept_list_add_device_by_bonding_s sl_bt_rsp_accept_list_add_device_by_bonding_t;


PACKSTRUCT( struct sl_bt_rsp_accept_list_add_device_by_address_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_accept_list_add_device_by_address_s sl_bt_rsp_accept_list_add_device_by_address_t;


PACKSTRUCT( struct sl_bt_rsp_accept_list_remove_device_by_bonding_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_accept_list_remove_device_by_bonding_s sl_bt_rsp_accept_list_remove_device_by_bonding_t;


PACKSTRUCT( struct sl_bt_rsp_accept_list_remove_device_by_address_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_accept_list_remove_device_by_address_s sl_bt_rsp_accept_list_remove_device_by_address_t;


PACKSTRUCT( struct sl_bt_rsp_accept_list_remove_all_devices_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_accept_list_remove_all_devices_s sl_bt_rsp_accept_list_remove_all_devices_t;


PACKSTRUCT( struct sl_bt_rsp_coex_set_options_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_coex_set_options_s sl_bt_rsp_coex_set_options_t;


PACKSTRUCT( struct sl_bt_rsp_coex_set_parameters_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_coex_set_parameters_s sl_bt_rsp_coex_set_parameters_t;


PACKSTRUCT( struct sl_bt_rsp_coex_set_directional_priority_pulse_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_coex_set_directional_priority_pulse_s sl_bt_rsp_coex_set_directional_priority_pulse_t;


PACKSTRUCT( struct sl_bt_rsp_coex_get_parameters_s
{
    uint16_t result;
    uint8_t priority;
    uint8_t request;
    uint8_t pwm_period;
    uint8_t pwm_dutycycle;
});

typedef struct sl_bt_rsp_coex_get_parameters_s sl_bt_rsp_coex_get_parameters_t;


PACKSTRUCT( struct sl_bt_rsp_coex_get_counters_s
{
    uint16_t result;
    uint8array counters;
});

typedef struct sl_bt_rsp_coex_get_counters_s sl_bt_rsp_coex_get_counters_t;


PACKSTRUCT( struct sl_bt_rsp_cs_security_enable_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_cs_security_enable_s sl_bt_rsp_cs_security_enable_t;


PACKSTRUCT( struct sl_bt_rsp_cs_set_default_settings_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_cs_set_default_settings_s sl_bt_rsp_cs_set_default_settings_t;


PACKSTRUCT( struct sl_bt_rsp_cs_create_config_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_cs_create_config_s sl_bt_rsp_cs_create_config_t;


PACKSTRUCT( struct sl_bt_rsp_cs_remove_config_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_cs_remove_config_s sl_bt_rsp_cs_remove_config_t;


PACKSTRUCT( struct sl_bt_rsp_cs_set_channel_classification_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_cs_set_channel_classification_s sl_bt_rsp_cs_set_channel_classification_t;


PACKSTRUCT( struct sl_bt_rsp_cs_set_procedure_parameters_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_cs_set_procedure_parameters_s sl_bt_rsp_cs_set_procedure_parameters_t;


PACKSTRUCT( struct sl_bt_rsp_cs_procedure_enable_s
{
    uint16_t result;
});

