SiliconLabsSoftware/boltON/NXP/ncp_host_MCXA156/source/sli_bt_api.h
typedef struct sl_bt_rsp_cs_procedure_enable_s sl_bt_rsp_cs_procedure_enable_t;


PACKSTRUCT( struct sl_bt_rsp_cs_set_antenna_configuration_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_cs_set_antenna_configuration_s sl_bt_rsp_cs_set_antenna_configuration_t;


PACKSTRUCT( struct sl_bt_rsp_cs_read_local_supported_capabilities_s
{
    uint16_t result;
    uint8_t num_config;
    uint16_t max_consecutive_procedures;
    uint8_t num_antennas;
    uint8_t max_antenna_paths;
    uint8_t roles;
    uint8_t modes;
    uint8_t rtt_capability;
    uint8_t rtt_aa_only;
    uint8_t rtt_sounding;
    uint8_t rtt_random_payload;
    uint8_t cs_sync_phys;
    uint16_t subfeatures;
    uint16_t t_ip1_times;
    uint16_t t_ip2_times;
    uint16_t t_fcs_times;
    uint16_t t_pm_times;
    uint8_t t_sw_times;
    uint8_t tx_snr_capability;
});

typedef struct sl_bt_rsp_cs_read_local_supported_capabilities_s sl_bt_rsp_cs_read_local_supported_capabilities_t;


PACKSTRUCT( struct sl_bt_rsp_cs_read_remote_supported_capabilities_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_cs_read_remote_supported_capabilities_s sl_bt_rsp_cs_read_remote_supported_capabilities_t;


PACKSTRUCT( struct sl_bt_rsp_cs_test_start_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_cs_test_start_s sl_bt_rsp_cs_test_start_t;


PACKSTRUCT( struct sl_bt_rsp_cs_test_end_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_cs_test_end_s sl_bt_rsp_cs_test_end_t;


PACKSTRUCT( struct sl_bt_rsp_l2cap_open_le_channel_s
{
    uint16_t result;
    uint16_t cid;
});

typedef struct sl_bt_rsp_l2cap_open_le_channel_s sl_bt_rsp_l2cap_open_le_channel_t;


PACKSTRUCT( struct sl_bt_rsp_l2cap_send_le_channel_open_response_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_l2cap_send_le_channel_open_response_s sl_bt_rsp_l2cap_send_le_channel_open_response_t;


PACKSTRUCT( struct sl_bt_rsp_l2cap_channel_send_data_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_l2cap_channel_send_data_s sl_bt_rsp_l2cap_channel_send_data_t;


PACKSTRUCT( struct sl_bt_rsp_l2cap_channel_send_credit_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_l2cap_channel_send_credit_s sl_bt_rsp_l2cap_channel_send_credit_t;


PACKSTRUCT( struct sl_bt_rsp_l2cap_close_channel_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_l2cap_close_channel_s sl_bt_rsp_l2cap_close_channel_t;


PACKSTRUCT( struct sl_bt_rsp_cte_transmitter_set_dtm_parameters_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_cte_transmitter_set_dtm_parameters_s sl_bt_rsp_cte_transmitter_set_dtm_parameters_t;


PACKSTRUCT( struct sl_bt_rsp_cte_transmitter_clear_dtm_parameters_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_cte_transmitter_clear_dtm_parameters_s sl_bt_rsp_cte_transmitter_clear_dtm_parameters_t;


PACKSTRUCT( struct sl_bt_rsp_cte_transmitter_enable_connection_cte_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_cte_transmitter_enable_connection_cte_s sl_bt_rsp_cte_transmitter_enable_connection_cte_t;


PACKSTRUCT( struct sl_bt_rsp_cte_transmitter_disable_connection_cte_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_cte_transmitter_disable_connection_cte_s sl_bt_rsp_cte_transmitter_disable_connection_cte_t;


PACKSTRUCT( struct sl_bt_rsp_cte_transmitter_enable_connectionless_cte_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_cte_transmitter_enable_connectionless_cte_s sl_bt_rsp_cte_transmitter_enable_connectionless_cte_t;


PACKSTRUCT( struct sl_bt_rsp_cte_transmitter_disable_connectionless_cte_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_cte_transmitter_disable_connectionless_cte_s sl_bt_rsp_cte_transmitter_disable_connectionless_cte_t;


PACKSTRUCT( struct sl_bt_rsp_cte_transmitter_enable_silabs_cte_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_cte_transmitter_enable_silabs_cte_s sl_bt_rsp_cte_transmitter_enable_silabs_cte_t;


PACKSTRUCT( struct sl_bt_rsp_cte_transmitter_disable_silabs_cte_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_cte_transmitter_disable_silabs_cte_s sl_bt_rsp_cte_transmitter_disable_silabs_cte_t;


PACKSTRUCT( struct sl_bt_rsp_cte_receiver_set_dtm_parameters_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_cte_receiver_set_dtm_parameters_s sl_bt_rsp_cte_receiver_set_dtm_parameters_t;


PACKSTRUCT( struct sl_bt_rsp_cte_receiver_clear_dtm_parameters_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_cte_receiver_clear_dtm_parameters_s sl_bt_rsp_cte_receiver_clear_dtm_parameters_t;


PACKSTRUCT( struct sl_bt_rsp_cte_receiver_set_sync_cte_type_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_cte_receiver_set_sync_cte_type_s sl_bt_rsp_cte_receiver_set_sync_cte_type_t;


PACKSTRUCT( struct sl_bt_rsp_cte_receiver_set_default_sync_receive_parameters_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_cte_receiver_set_default_sync_receive_parameters_s sl_bt_rsp_cte_receiver_set_default_sync_receive_parameters_t;


PACKSTRUCT( struct sl_bt_rsp_cte_receiver_set_sync_receive_parameters_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_cte_receiver_set_sync_receive_parameters_s sl_bt_rsp_cte_receiver_set_sync_receive_parameters_t;


PACKSTRUCT( struct sl_bt_rsp_cte_receiver_configure_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_cte_receiver_configure_s sl_bt_rsp_cte_receiver_configure_t;


PACKSTRUCT( struct sl_bt_rsp_cte_receiver_enable_connection_cte_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_cte_receiver_enable_connection_cte_s sl_bt_rsp_cte_receiver_enable_connection_cte_t;


PACKSTRUCT( struct sl_bt_rsp_cte_receiver_disable_connection_cte_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_cte_receiver_disable_connection_cte_s sl_bt_rsp_cte_receiver_disable_connection_cte_t;


PACKSTRUCT( struct sl_bt_rsp_cte_receiver_enable_connectionless_cte_s
{
    uint16_t result;
});

typedef struct sl_bt_rsp_cte_receiver_enable_connectionless_cte_s sl_bt_rsp_cte_receiver_enable_connectionless_cte_t;


PACKSTRUCT( struct sl_bt_rsp_cte_receiver_disable_connectionless_cte_s
{
    uint16_t result;
});

