SiliconLabsSoftware/boltON/NXP/ncp_host_MCXA156/source/sli_bt_api.h
    sl_bt_rsp_system_get_tx_power_setting_t                      rsp_system_get_tx_power_setting;
    sl_bt_rsp_system_set_identity_address_t                      rsp_system_set_identity_address;
    sl_bt_rsp_system_get_identity_address_t                      rsp_system_get_identity_address;
    sl_bt_rsp_system_get_random_data_t                           rsp_system_get_random_data;
    sl_bt_rsp_system_data_buffer_write_t                         rsp_system_data_buffer_write;
    sl_bt_rsp_system_data_buffer_clear_t                         rsp_system_data_buffer_clear;
    sl_bt_rsp_system_get_counters_t                              rsp_system_get_counters;
    sl_bt_rsp_system_set_lazy_soft_timer_t                       rsp_system_set_lazy_soft_timer;
    sl_bt_rsp_resource_get_status_t                              rsp_resource_get_status;
    sl_bt_rsp_resource_set_report_threshold_t                    rsp_resource_set_report_threshold;
    sl_bt_rsp_resource_enable_connection_tx_report_t             rsp_resource_enable_connection_tx_report;
    sl_bt_rsp_resource_get_connection_tx_status_t                rsp_resource_get_connection_tx_status;
    sl_bt_rsp_resource_disable_connection_tx_report_t            rsp_resource_disable_connection_tx_report;
    sl_bt_rsp_gap_set_privacy_mode_t                             rsp_gap_set_privacy_mode;
    sl_bt_rsp_gap_set_data_channel_classification_t              rsp_gap_set_data_channel_classification;
    sl_bt_rsp_gap_set_identity_address_t                         rsp_gap_set_identity_address;
    sl_bt_rsp_gap_get_identity_address_t                         rsp_gap_get_identity_address;
    sl_bt_rsp_advertiser_create_set_t                            rsp_advertiser_create_set;
    sl_bt_rsp_advertiser_configure_t                             rsp_advertiser_configure;
    sl_bt_rsp_advertiser_set_timing_t                            rsp_advertiser_set_timing;
    sl_bt_rsp_advertiser_set_channel_map_t                       rsp_advertiser_set_channel_map;
    sl_bt_rsp_advertiser_set_tx_power_t                          rsp_advertiser_set_tx_power;
    sl_bt_rsp_advertiser_set_report_scan_request_t               rsp_advertiser_set_report_scan_request;
    sl_bt_rsp_advertiser_set_random_address_t                    rsp_advertiser_set_random_address;
    sl_bt_rsp_advertiser_clear_random_address_t                  rsp_advertiser_clear_random_address;
    sl_bt_rsp_advertiser_stop_t                                  rsp_advertiser_stop;
    sl_bt_rsp_advertiser_delete_set_t                            rsp_advertiser_delete_set;
    sl_bt_rsp_legacy_advertiser_set_data_t                       rsp_legacy_advertiser_set_data;
    sl_bt_rsp_legacy_advertiser_generate_data_t                  rsp_legacy_advertiser_generate_data;
    sl_bt_rsp_legacy_advertiser_start_t                          rsp_legacy_advertiser_start;
    sl_bt_rsp_legacy_advertiser_start_directed_t                 rsp_legacy_advertiser_start_directed;
    sl_bt_rsp_extended_advertiser_set_phy_t                      rsp_extended_advertiser_set_phy;
    sl_bt_rsp_extended_advertiser_set_data_t                     rsp_extended_advertiser_set_data;
    sl_bt_rsp_extended_advertiser_set_long_data_t                rsp_extended_advertiser_set_long_data;
    sl_bt_rsp_extended_advertiser_generate_data_t                rsp_extended_advertiser_generate_data;
    sl_bt_rsp_extended_advertiser_start_t                        rsp_extended_advertiser_start;
    sl_bt_rsp_extended_advertiser_start_directed_t               rsp_extended_advertiser_start_directed;
    sl_bt_rsp_periodic_advertiser_set_data_t                     rsp_periodic_advertiser_set_data;
    sl_bt_rsp_periodic_advertiser_set_long_data_t                rsp_periodic_advertiser_set_long_data;
    sl_bt_rsp_periodic_advertiser_start_t                        rsp_periodic_advertiser_start;
    sl_bt_rsp_periodic_advertiser_stop_t                         rsp_periodic_advertiser_stop;
    sl_bt_rsp_scanner_set_parameters_t                           rsp_scanner_set_parameters;
    sl_bt_rsp_scanner_set_parameters_and_filter_t                rsp_scanner_set_parameters_and_filter;
    sl_bt_rsp_scanner_start_t                                    rsp_scanner_start;
    sl_bt_rsp_scanner_stop_t                                     rsp_scanner_stop;
    sl_bt_rsp_sync_set_reporting_mode_t                          rsp_sync_set_reporting_mode;
    sl_bt_rsp_sync_update_sync_parameters_t                      rsp_sync_update_sync_parameters;
    sl_bt_rsp_sync_close_t                                       rsp_sync_close;
    sl_bt_rsp_sync_scanner_set_sync_parameters_t                 rsp_sync_scanner_set_sync_parameters;
    sl_bt_rsp_sync_scanner_open_t                                rsp_sync_scanner_open;
    sl_bt_rsp_past_receiver_set_default_sync_receive_parameters_t rsp_past_receiver_set_default_sync_receive_parameters;
    sl_bt_rsp_past_receiver_set_sync_receive_parameters_t        rsp_past_receiver_set_sync_receive_parameters;
    sl_bt_rsp_advertiser_past_transfer_t                         rsp_advertiser_past_transfer;
    sl_bt_rsp_sync_past_transfer_t                               rsp_sync_past_transfer;
    sl_bt_rsp_pawr_sync_set_sync_subevents_t                     rsp_pawr_sync_set_sync_subevents;
    sl_bt_rsp_pawr_sync_set_response_data_t                      rsp_pawr_sync_set_response_data;
    sl_bt_rsp_pawr_advertiser_start_t                            rsp_pawr_advertiser_start;
    sl_bt_rsp_pawr_advertiser_set_subevent_data_t                rsp_pawr_advertiser_set_subevent_data;
    sl_bt_rsp_pawr_advertiser_create_connection_t                rsp_pawr_advertiser_create_connection;
    sl_bt_rsp_pawr_advertiser_stop_t                             rsp_pawr_advertiser_stop;
    sl_bt_rsp_connection_set_default_parameters_t                rsp_connection_set_default_parameters;
    sl_bt_rsp_connection_set_default_preferred_phy_t             rsp_connection_set_default_preferred_phy;
    sl_bt_rsp_connection_set_default_data_length_t               rsp_connection_set_default_data_length;
    sl_bt_rsp_connection_set_default_acceptable_subrate_t        rsp_connection_set_default_acceptable_subrate;
    sl_bt_rsp_connection_open_t                                  rsp_connection_open;
    sl_bt_rsp_connection_open_with_accept_list_t                 rsp_connection_open_with_accept_list;
    sl_bt_rsp_connection_set_parameters_t                        rsp_connection_set_parameters;
    sl_bt_rsp_connection_set_preferred_phy_t                     rsp_connection_set_preferred_phy;
    sl_bt_rsp_connection_disable_slave_latency_t                 rsp_connection_disable_slave_latency;
    sl_bt_rsp_connection_get_median_rssi_t                       rsp_connection_get_median_rssi;
    sl_bt_rsp_connection_read_channel_map_t                      rsp_connection_read_channel_map;
    sl_bt_rsp_connection_set_power_reporting_t                   rsp_connection_set_power_reporting;
    sl_bt_rsp_connection_set_remote_power_reporting_t            rsp_connection_set_remote_power_reporting;
    sl_bt_rsp_connection_get_tx_power_t                          rsp_connection_get_tx_power;
    sl_bt_rsp_connection_get_remote_tx_power_t                   rsp_connection_get_remote_tx_power;
    sl_bt_rsp_connection_set_tx_power_t                          rsp_connection_set_tx_power;
    sl_bt_rsp_connection_read_remote_used_features_t             rsp_connection_read_remote_used_features;
    sl_bt_rsp_connection_get_security_status_t                   rsp_connection_get_security_status;
    sl_bt_rsp_connection_set_data_length_t                       rsp_connection_set_data_length;
    sl_bt_rsp_connection_read_statistics_t                       rsp_connection_read_statistics;
    sl_bt_rsp_connection_get_scheduling_details_t                rsp_connection_get_scheduling_details;
    sl_bt_rsp_connection_get_remote_address_t                    rsp_connection_get_remote_address;
    sl_bt_rsp_connection_request_subrate_t                       rsp_connection_request_subrate;
    sl_bt_rsp_connection_get_state_t                             rsp_connection_get_state;
    sl_bt_rsp_connection_close_t                                 rsp_connection_close;
    sl_bt_rsp_connection_forcefully_close_t                      rsp_connection_forcefully_close;
    sl_bt_rsp_gatt_set_max_mtu_t                                 rsp_gatt_set_max_mtu;
    sl_bt_rsp_gatt_discover_primary_services_t                   rsp_gatt_discover_primary_services;
    sl_bt_rsp_gatt_discover_primary_services_by_uuid_t           rsp_gatt_discover_primary_services_by_uuid;
    sl_bt_rsp_gatt_find_included_services_t                      rsp_gatt_find_included_services;
    sl_bt_rsp_gatt_discover_characteristics_t                    rsp_gatt_discover_characteristics;
    sl_bt_rsp_gatt_discover_characteristics_by_uuid_t            rsp_gatt_discover_characteristics_by_uuid;
    sl_bt_rsp_gatt_discover_descriptors_t                        rsp_gatt_discover_descriptors;
    sl_bt_rsp_gatt_discover_characteristic_descriptors_t         rsp_gatt_discover_characteristic_descriptors;
    sl_bt_rsp_gatt_set_characteristic_notification_t             rsp_gatt_set_characteristic_notification;
    sl_bt_rsp_gatt_send_characteristic_confirmation_t            rsp_gatt_send_characteristic_confirmation;
    sl_bt_rsp_gatt_read_characteristic_value_t                   rsp_gatt_read_characteristic_value;
    sl_bt_rsp_gatt_read_characteristic_value_from_offset_t       rsp_gatt_read_characteristic_value_from_offset;
    sl_bt_rsp_gatt_read_multiple_characteristic_values_t         rsp_gatt_read_multiple_characteristic_values;
    sl_bt_rsp_gatt_read_variable_length_characteristic_values_t  rsp_gatt_read_variable_length_characteristic_values;
    sl_bt_rsp_gatt_read_characteristic_value_by_uuid_t           rsp_gatt_read_characteristic_value_by_uuid;
    sl_bt_rsp_gatt_write_characteristic_value_t                  rsp_gatt_write_characteristic_value;
    sl_bt_rsp_gatt_write_characteristic_value_without_response_t rsp_gatt_write_characteristic_value_without_response;
    sl_bt_rsp_gatt_prepare_characteristic_value_write_t          rsp_gatt_prepare_characteristic_value_write;
    sl_bt_rsp_gatt_prepare_characteristic_value_reliable_write_t rsp_gatt_prepare_characteristic_value_reliable_write;
    sl_bt_rsp_gatt_execute_characteristic_value_write_t          rsp_gatt_execute_characteristic_value_write;
    sl_bt_rsp_gatt_read_descriptor_value_t                       rsp_gatt_read_descriptor_value;
    sl_bt_rsp_gatt_write_descriptor_value_t                      rsp_gatt_write_descriptor_value;
    sl_bt_rsp_gatt_get_mtu_t                                     rsp_gatt_get_mtu;
    sl_bt_rsp_gattdb_new_session_t                               rsp_gattdb_new_session;
    sl_bt_rsp_gattdb_add_service_t                               rsp_gattdb_add_service;
    sl_bt_rsp_gattdb_remove_service_t                            rsp_gattdb_remove_service;
    sl_bt_rsp_gattdb_add_included_service_t                      rsp_gattdb_add_included_service;
    sl_bt_rsp_gattdb_remove_included_service_t                   rsp_gattdb_remove_included_service;
    sl_bt_rsp_gattdb_add_uuid16_characteristic_t                 rsp_gattdb_add_uuid16_characteristic;
    sl_bt_rsp_gattdb_add_uuid128_characteristic_t                rsp_gattdb_add_uuid128_characteristic;
    sl_bt_rsp_gattdb_remove_characteristic_t                     rsp_gattdb_remove_characteristic;
    sl_bt_rsp_gattdb_add_uuid16_descriptor_t                     rsp_gattdb_add_uuid16_descriptor;
    sl_bt_rsp_gattdb_add_uuid128_descriptor_t                    rsp_gattdb_add_uuid128_descriptor;
    sl_bt_rsp_gattdb_remove_descriptor_t                         rsp_gattdb_remove_descriptor;
    sl_bt_rsp_gattdb_start_service_t                             rsp_gattdb_start_service;
    sl_bt_rsp_gattdb_stop_service_t                              rsp_gattdb_stop_service;
    sl_bt_rsp_gattdb_start_characteristic_t                      rsp_gattdb_start_characteristic;
    sl_bt_rsp_gattdb_stop_characteristic_t                       rsp_gattdb_stop_characteristic;
    sl_bt_rsp_gattdb_commit_t                                    rsp_gattdb_commit;
    sl_bt_rsp_gattdb_abort_t                                     rsp_gattdb_abort;
    sl_bt_rsp_gattdb_get_attribute_state_t                       rsp_gattdb_get_attribute_state;
    sl_bt_rsp_gatt_server_set_max_mtu_t                          rsp_gatt_server_set_max_mtu;
    sl_bt_rsp_gatt_server_get_mtu_t                              rsp_gatt_server_get_mtu;
    sl_bt_rsp_gatt_server_find_attribute_t                       rsp_gatt_server_find_attribute;
    sl_bt_rsp_gatt_server_find_primary_service_t                 rsp_gatt_server_find_primary_service;
    sl_bt_rsp_gatt_server_read_attribute_value_t                 rsp_gatt_server_read_attribute_value;
    sl_bt_rsp_gatt_server_read_attribute_type_t                  rsp_gatt_server_read_attribute_type;
    sl_bt_rsp_gatt_server_read_attribute_properties_t            rsp_gatt_server_read_attribute_properties;
    sl_bt_rsp_gatt_server_write_attribute_value_t                rsp_gatt_server_write_attribute_value;
    sl_bt_rsp_gatt_server_send_user_read_response_t              rsp_gatt_server_send_user_read_response;
    sl_bt_rsp_gatt_server_send_user_write_response_t             rsp_gatt_server_send_user_write_response;
    sl_bt_rsp_gatt_server_send_notification_t                    rsp_gatt_server_send_notification;
    sl_bt_rsp_gatt_server_send_indication_t                      rsp_gatt_server_send_indication;
    sl_bt_rsp_gatt_server_notify_all_t                           rsp_gatt_server_notify_all;
    sl_bt_rsp_gatt_server_read_client_configuration_t            rsp_gatt_server_read_client_configuration;
    sl_bt_rsp_gatt_server_send_user_prepare_write_response_t     rsp_gatt_server_send_user_prepare_write_response;
    sl_bt_rsp_gatt_server_set_capabilities_t                     rsp_gatt_server_set_capabilities;
    sl_bt_rsp_gatt_server_enable_capabilities_t                  rsp_gatt_server_enable_capabilities;
    sl_bt_rsp_gatt_server_disable_capabilities_t                 rsp_gatt_server_disable_capabilities;
    sl_bt_rsp_gatt_server_get_enabled_capabilities_t             rsp_gatt_server_get_enabled_capabilities;
    sl_bt_rsp_gatt_server_read_client_supported_features_t       rsp_gatt_server_read_client_supported_features;
    sl_bt_rsp_nvm_save_t                                         rsp_nvm_save;
    sl_bt_rsp_nvm_load_t                                         rsp_nvm_load;
    sl_bt_rsp_nvm_erase_t                                        rsp_nvm_erase;
    sl_bt_rsp_nvm_erase_all_t                                    rsp_nvm_erase_all;
    sl_bt_rsp_test_dtm_tx_v4_t                                   rsp_test_dtm_tx_v4;
    sl_bt_rsp_test_dtm_tx_cw_t                                   rsp_test_dtm_tx_cw;
    sl_bt_rsp_test_dtm_rx_t                                      rsp_test_dtm_rx;
    sl_bt_rsp_test_dtm_end_t                                     rsp_test_dtm_end;
    sl_bt_rsp_sm_configure_t                                     rsp_sm_configure;
    sl_bt_rsp_sm_set_minimum_key_size_t                          rsp_sm_set_minimum_key_size;
    sl_bt_rsp_sm_set_debug_mode_t                                rsp_sm_set_debug_mode;
    sl_bt_rsp_sm_store_bonding_configuration_t                   rsp_sm_store_bonding_configuration;
    sl_bt_rsp_sm_set_bondable_mode_t                             rsp_sm_set_bondable_mode;
    sl_bt_rsp_sm_set_passkey_t                                   rsp_sm_set_passkey;
    sl_bt_rsp_sm_increase_security_t                             rsp_sm_increase_security;
    sl_bt_rsp_sm_enter_passkey_t                                 rsp_sm_enter_passkey;
    sl_bt_rsp_sm_passkey_confirm_t                               rsp_sm_passkey_confirm;
    sl_bt_rsp_sm_bonding_confirm_t                               rsp_sm_bonding_confirm;
    sl_bt_rsp_sm_delete_bonding_t                                rsp_sm_delete_bonding;
    sl_bt_rsp_sm_delete_bondings_t                               rsp_sm_delete_bondings;
    sl_bt_rsp_sm_get_bonding_handles_t                           rsp_sm_get_bonding_handles;
    sl_bt_rsp_sm_get_bonding_details_t                           rsp_sm_get_bonding_details;
    sl_bt_rsp_sm_find_bonding_by_address_t                       rsp_sm_find_bonding_by_address;
    sl_bt_rsp_sm_resolve_rpa_t                                   rsp_sm_resolve_rpa;
    sl_bt_rsp_sm_set_bonding_key_t                               rsp_sm_set_bonding_key;
    sl_bt_rsp_sm_set_legacy_oob_t                                rsp_sm_set_legacy_oob;
    sl_bt_rsp_sm_set_oob_t                                       rsp_sm_set_oob;
    sl_bt_rsp_sm_set_remote_oob_t                                rsp_sm_set_remote_oob;
    sl_bt_rsp_external_bondingdb_set_data_t                      rsp_external_bondingdb_set_data;
    sl_bt_rsp_resolving_list_add_device_by_bonding_t             rsp_resolving_list_add_device_by_bonding;
    sl_bt_rsp_resolving_list_add_device_by_address_t             rsp_resolving_list_add_device_by_address;
    sl_bt_rsp_resolving_list_remove_device_by_bonding_t          rsp_resolving_list_remove_device_by_bonding;
    sl_bt_rsp_resolving_list_remove_device_by_address_t          rsp_resolving_list_remove_device_by_address;
    sl_bt_rsp_resolving_list_remove_all_devices_t                rsp_resolving_list_remove_all_devices;
    sl_bt_rsp_accept_list_add_device_by_bonding_t                rsp_accept_list_add_device_by_bonding;
    sl_bt_rsp_accept_list_add_device_by_address_t                rsp_accept_list_add_device_by_address;
    sl_bt_rsp_accept_list_remove_device_by_bonding_t             rsp_accept_list_remove_device_by_bonding;
    sl_bt_rsp_accept_list_remove_device_by_address_t             rsp_accept_list_remove_device_by_address;
    sl_bt_rsp_accept_list_remove_all_devices_t                   rsp_accept_list_remove_all_devices;
    sl_bt_rsp_coex_set_options_t                                 rsp_coex_set_options;
    sl_bt_rsp_coex_set_parameters_t                              rsp_coex_set_parameters;
    sl_bt_rsp_coex_set_directional_priority_pulse_t              rsp_coex_set_directional_priority_pulse;
    sl_bt_rsp_coex_get_parameters_t                              rsp_coex_get_parameters;
    sl_bt_rsp_coex_get_counters_t                                rsp_coex_get_counters;
    sl_bt_rsp_cs_security_enable_t                               rsp_cs_security_enable;
    sl_bt_rsp_cs_set_default_settings_t                          rsp_cs_set_default_settings;
    sl_bt_rsp_cs_create_config_t                                 rsp_cs_create_config;
    sl_bt_rsp_cs_remove_config_t                                 rsp_cs_remove_config;
    sl_bt_rsp_cs_set_channel_classification_t                    rsp_cs_set_channel_classification;
    sl_bt_rsp_cs_set_procedure_parameters_t                      rsp_cs_set_procedure_parameters;
    sl_bt_rsp_cs_procedure_enable_t                              rsp_cs_procedure_enable;
    sl_bt_rsp_cs_set_antenna_configuration_t                     rsp_cs_set_antenna_configuration;
    sl_bt_rsp_cs_read_local_supported_capabilities_t             rsp_cs_read_local_supported_capabilities;
    sl_bt_rsp_cs_read_remote_supported_capabilities_t            rsp_cs_read_remote_supported_capabilities;
    sl_bt_rsp_cs_test_start_t                                    rsp_cs_test_start;
    sl_bt_rsp_cs_test_end_t                                      rsp_cs_test_end;
    sl_bt_rsp_l2cap_open_le_channel_t                            rsp_l2cap_open_le_channel;
    sl_bt_rsp_l2cap_send_le_channel_open_response_t              rsp_l2cap_send_le_channel_open_response;
    sl_bt_rsp_l2cap_channel_send_data_t                          rsp_l2cap_channel_send_data;
    sl_bt_rsp_l2cap_channel_send_credit_t                        rsp_l2cap_channel_send_credit;
    sl_bt_rsp_l2cap_close_channel_t                              rsp_l2cap_close_channel;
    sl_bt_rsp_cte_transmitter_set_dtm_parameters_t               rsp_cte_transmitter_set_dtm_parameters;
    sl_bt_rsp_cte_transmitter_clear_dtm_parameters_t             rsp_cte_transmitter_clear_dtm_parameters;
    sl_bt_rsp_cte_transmitter_enable_connection_cte_t            rsp_cte_transmitter_enable_connection_cte;
    sl_bt_rsp_cte_transmitter_disable_connection_cte_t           rsp_cte_transmitter_disable_connection_cte;
    sl_bt_rsp_cte_transmitter_enable_connectionless_cte_t        rsp_cte_transmitter_enable_connectionless_cte;
    sl_bt_rsp_cte_transmitter_disable_connectionless_cte_t       rsp_cte_transmitter_disable_connectionless_cte;
    sl_bt_rsp_cte_transmitter_enable_silabs_cte_t                rsp_cte_transmitter_enable_silabs_cte;
    sl_bt_rsp_cte_transmitter_disable_silabs_cte_t               rsp_cte_transmitter_disable_silabs_cte;
    sl_bt_rsp_cte_receiver_set_dtm_parameters_t                  rsp_cte_receiver_set_dtm_parameters;
    sl_bt_rsp_cte_receiver_clear_dtm_parameters_t                rsp_cte_receiver_clear_dtm_parameters;
    sl_bt_rsp_cte_receiver_set_sync_cte_type_t                   rsp_cte_receiver_set_sync_cte_type;
    sl_bt_rsp_cte_receiver_set_default_sync_receive_parameters_t rsp_cte_receiver_set_default_sync_receive_parameters;
    sl_bt_rsp_cte_receiver_set_sync_receive_parameters_t         rsp_cte_receiver_set_sync_receive_parameters;
    sl_bt_rsp_cte_receiver_configure_t                           rsp_cte_receiver_configure;
    sl_bt_rsp_cte_receiver_enable_connection_cte_t               rsp_cte_receiver_enable_connection_cte;
    sl_bt_rsp_cte_receiver_disable_connection_cte_t              rsp_cte_receiver_disable_connection_cte;
    sl_bt_rsp_cte_receiver_enable_connectionless_cte_t           rsp_cte_receiver_enable_connectionless_cte;
    sl_bt_rsp_cte_receiver_disable_connectionless_cte_t          rsp_cte_receiver_disable_connectionless_cte;
    sl_bt_rsp_cte_receiver_enable_silabs_cte_t                   rsp_cte_receiver_enable_silabs_cte;
    sl_bt_rsp_cte_receiver_disable_silabs_cte_t                  rsp_cte_receiver_disable_silabs_cte;
    sl_bt_rsp_connection_analyzer_start_t                        rsp_connection_analyzer_start;
    sl_bt_rsp_connection_analyzer_stop_t                         rsp_connection_analyzer_stop;
    sl_bt_rsp_user_message_to_target_t                           rsp_user_message_to_target;
    sl_bt_rsp_user_manage_event_filter_t                         rsp_user_manage_event_filter;
    sl_bt_rsp_user_cs_service_message_to_target_t                rsp_user_cs_service_message_to_target;
    sl_bt_evt_dfu_boot_t                                         evt_dfu_boot;
    sl_bt_evt_dfu_boot_failure_t                                 evt_dfu_boot_failure;
    sl_bt_evt_system_boot_t                                      evt_system_boot;
    sl_bt_evt_system_error_t                                     evt_system_error;
    sl_bt_evt_system_resource_exhausted_t                        evt_system_resource_exhausted;
    sl_bt_evt_system_external_signal_t                           evt_system_external_signal;
    sl_bt_evt_system_soft_timer_t                                evt_system_soft_timer;
    sl_bt_evt_resource_status_t                                  evt_resource_status;
    sl_bt_evt_advertiser_timeout_t                               evt_advertiser_timeout;
    sl_bt_evt_advertiser_scan_request_t                          evt_advertiser_scan_request;
    sl_bt_evt_periodic_advertiser_status_t                       evt_periodic_advertiser_status;
    sl_bt_evt_scanner_legacy_advertisement_report_t              evt_scanner_legacy_advertisement_report;
