SiliconLabsSoftware/boltON/NXP/ncp_host_MCXA156/source/sli_bt_api.h
    sl_bt_evt_scanner_extended_advertisement_report_t            evt_scanner_extended_advertisement_report;
    sl_bt_evt_sync_closed_t                                      evt_sync_closed;
    sl_bt_evt_periodic_sync_opened_t                             evt_periodic_sync_opened;
    sl_bt_evt_periodic_sync_transfer_received_t                  evt_periodic_sync_transfer_received;
    sl_bt_evt_periodic_sync_report_t                             evt_periodic_sync_report;
    sl_bt_evt_pawr_sync_opened_t                                 evt_pawr_sync_opened;
    sl_bt_evt_pawr_sync_transfer_received_t                      evt_pawr_sync_transfer_received;
    sl_bt_evt_pawr_sync_subevent_report_t                        evt_pawr_sync_subevent_report;
    sl_bt_evt_pawr_advertiser_subevent_data_request_t            evt_pawr_advertiser_subevent_data_request;
    sl_bt_evt_pawr_advertiser_subevent_tx_failed_t               evt_pawr_advertiser_subevent_tx_failed;
    sl_bt_evt_pawr_advertiser_response_report_t                  evt_pawr_advertiser_response_report;
    sl_bt_evt_connection_opened_t                                evt_connection_opened;
    sl_bt_evt_connection_parameters_t                            evt_connection_parameters;
    sl_bt_evt_connection_set_parameters_failed_t                 evt_connection_set_parameters_failed;
    sl_bt_evt_connection_phy_status_t                            evt_connection_phy_status;
    sl_bt_evt_connection_get_remote_tx_power_completed_t         evt_connection_get_remote_tx_power_completed;
    sl_bt_evt_connection_tx_power_t                              evt_connection_tx_power;
    sl_bt_evt_connection_remote_tx_power_t                       evt_connection_remote_tx_power;
    sl_bt_evt_connection_remote_used_features_t                  evt_connection_remote_used_features;
    sl_bt_evt_connection_data_length_t                           evt_connection_data_length;
    sl_bt_evt_connection_statistics_t                            evt_connection_statistics;
    sl_bt_evt_connection_request_subrate_failed_t                evt_connection_request_subrate_failed;
    sl_bt_evt_connection_subrate_changed_t                       evt_connection_subrate_changed;
    sl_bt_evt_connection_closed_t                                evt_connection_closed;
    sl_bt_evt_gatt_mtu_exchanged_t                               evt_gatt_mtu_exchanged;
    sl_bt_evt_gatt_service_t                                     evt_gatt_service;
    sl_bt_evt_gatt_characteristic_t                              evt_gatt_characteristic;
    sl_bt_evt_gatt_descriptor_t                                  evt_gatt_descriptor;
    sl_bt_evt_gatt_characteristic_value_t                        evt_gatt_characteristic_value;
    sl_bt_evt_gatt_descriptor_value_t                            evt_gatt_descriptor_value;
    sl_bt_evt_gatt_procedure_completed_t                         evt_gatt_procedure_completed;
    sl_bt_evt_gatt_server_attribute_value_t                      evt_gatt_server_attribute_value;
    sl_bt_evt_gatt_server_user_read_request_t                    evt_gatt_server_user_read_request;
    sl_bt_evt_gatt_server_user_write_request_t                   evt_gatt_server_user_write_request;
    sl_bt_evt_gatt_server_characteristic_status_t                evt_gatt_server_characteristic_status;
    sl_bt_evt_gatt_server_execute_write_completed_t              evt_gatt_server_execute_write_completed;
    sl_bt_evt_gatt_server_indication_timeout_t                   evt_gatt_server_indication_timeout;
    sl_bt_evt_gatt_server_notification_tx_completed_t            evt_gatt_server_notification_tx_completed;
    sl_bt_evt_test_dtm_completed_t                               evt_test_dtm_completed;
    sl_bt_evt_sm_passkey_display_t                               evt_sm_passkey_display;
    sl_bt_evt_sm_passkey_request_t                               evt_sm_passkey_request;
    sl_bt_evt_sm_confirm_passkey_t                               evt_sm_confirm_passkey;
    sl_bt_evt_sm_bonded_t                                        evt_sm_bonded;
    sl_bt_evt_sm_bonding_failed_t                                evt_sm_bonding_failed;
    sl_bt_evt_sm_confirm_bonding_t                               evt_sm_confirm_bonding;
    sl_bt_evt_external_bondingdb_data_request_t                  evt_external_bondingdb_data_request;
    sl_bt_evt_external_bondingdb_data_t                          evt_external_bondingdb_data;
    sl_bt_evt_external_bondingdb_data_ready_t                    evt_external_bondingdb_data_ready;
    sl_bt_evt_cs_security_enable_complete_t                      evt_cs_security_enable_complete;
    sl_bt_evt_cs_config_complete_t                               evt_cs_config_complete;
    sl_bt_evt_cs_procedure_enable_complete_t                     evt_cs_procedure_enable_complete;
    sl_bt_evt_cs_result_t                                        evt_cs_result;
    sl_bt_evt_cs_result_continue_t                               evt_cs_result_continue;
    sl_bt_evt_cs_read_remote_supported_capabilities_complete_t   evt_cs_read_remote_supported_capabilities_complete;
    sl_bt_evt_cs_test_end_completed_t                            evt_cs_test_end_completed;
    sl_bt_evt_l2cap_le_channel_open_request_t                    evt_l2cap_le_channel_open_request;
    sl_bt_evt_l2cap_le_channel_open_response_t                   evt_l2cap_le_channel_open_response;
    sl_bt_evt_l2cap_channel_data_t                               evt_l2cap_channel_data;
    sl_bt_evt_l2cap_channel_credit_t                             evt_l2cap_channel_credit;
    sl_bt_evt_l2cap_channel_closed_t                             evt_l2cap_channel_closed;
    sl_bt_evt_l2cap_command_rejected_t                           evt_l2cap_command_rejected;
    sl_bt_evt_cte_receiver_dtm_iq_report_t                       evt_cte_receiver_dtm_iq_report;
    sl_bt_evt_cte_receiver_connection_iq_report_t                evt_cte_receiver_connection_iq_report;
    sl_bt_evt_cte_receiver_connectionless_iq_report_t            evt_cte_receiver_connectionless_iq_report;
    sl_bt_evt_cte_receiver_silabs_iq_report_t                    evt_cte_receiver_silabs_iq_report;
    sl_bt_evt_connection_analyzer_report_t                       evt_connection_analyzer_report;
    sl_bt_evt_connection_analyzer_completed_t                    evt_connection_analyzer_completed;
    sl_bt_evt_user_message_to_host_t                             evt_user_message_to_host;
    sl_bt_evt_user_cs_service_message_to_host_t                  evt_user_cs_service_message_to_host;
    uint8_t payload[SL_BGAPI_MAX_PAYLOAD_SIZE];
  } data;
});

#ifdef __cplusplus
}
#endif

#endif